<?xml version="1.0"?>
<rss version="2.0">
  <channel>
    <title>&#x7D19;&#x98DB;&#x6A5F;</title>
    <description>&#x7D19;&#x98DB;&#x6A5F;</description>
    <link>http://junqili.com</link>
    <pubDate>2014-06-25</pubDate>
    <item>
      <title>Getting Started With Load Average</title>
      <link>http://junqili.com/linux/getting-started-with-load-average</link>
      <pubDate>2014-06-15</pubDate>
      <description>&lt;h3 id="toc_0"&gt;what&lt;/h3&gt;

&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&#x4EC0;&#x4E48;&#x662F;Load Average&lt;/p&gt;

&lt;p&gt;&lt;a href="http://en.wikipedia.org/wiki/Load_(computing)"&gt;Load&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x5DE5;&#x4F5C;&#x91CF;&#x7684;&#x5EA6;&#x91CF;&lt;/a&gt;&#x3002;Load Average&#x5C31;&#x662F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;(1&#x5206;&#x949F;&#xFF0C;5&#x5206;&#x949F;&#xFF0C;15&#x5206;&#x949F;)&#x7CFB;&#x7EDF;Load&#x7684;&#x5E73;&#x5747;&#x503C;&#x3002;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;(1&#x5206;&#x949F;&#xFF0C;5&#x5206;&#x949F;&#xFF0C;15&#x5206;&#x949F;)&#x8FD0;&#x884C;&#x961F;&#x5217;&#x91CC;&#x7B49;&#x5F85;&#x7684;&#x8FDB;&#x7A0B;&#x6570;&#x52A0;&#x4E0A;&#x5F53;&#x524D;&#x6B63;&#x5728;&#x6267;&#x884C;&#x7684;&#x8FDB;&#x7A0B;&#x6570;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;uptime&#x547D;&#x4EE4;&#x67E5;&#x770B;&#x3002;&lt;/p&gt;

&lt;pre&gt;&lt;code&gt;uptime

21:45  up 22:37, 3 users, load averages: 1.81 1.79 1.58
&lt;/code&gt;&lt;/pre&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x54EA;&#x4E9B;&#x8FDB;&#x7A0B;&#x88AB;&#x7EDF;&#x8BA1;&#x5728;&#x5185;&lt;/p&gt;

&lt;p&gt;&#x4E00;&#x4E2A;&#x7A7A;&#x95F2;&#x7684;&#x8BA1;&#x7B97;&#x673A;load&#x503C;&#x4E3A;0&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;&#x6216;&#x8005;&#x7B49;&#x5F85;CPU&#x7684;&#x8FDB;&#x7A0B;&#x4F7F;Load&#x503C;&#x589E;1&#x3002;&#x5927;&#x591A;&#x6570;UNIX&#x7CFB;&#x7EDF;&#x4EC5;&#x4EC5;&#x8BA1;&#x7B97;&#x5904;&#x4E8E;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x6216;&#x8005;&#x7B49;&#x5F85;&#x8FD0;&#x884C;(running or runnable)&#x72B6;&#x6001;&#x7684;&#x8FDB;&#x7A0B;&#x3002;&#x4F46;&#x662F;Linux&#x540C;&#x6837;&#x5305;&#x62EC;&#x5904;&#x4E8E;&#x4E0D;&#x53EF;&#x4E2D;&#x65AD;(uniterruptible)&#x72B6;&#x6001;&#x7684;&#x8FDB;&#x7A0B;(&#x901A;&#x5E38;&#x662F;&#x7B49;&#x5F85;I/O)&#xFF0C;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x4E0A;&#x6709;&#x8BB8;&#x591A;&#x8FDB;&#x7A0B;&#x56E0;&#x4E3A;I/O&#x7E41;&#x5FD9;&#x88AB;&#x963B;&#x585E;&#x4F1A;&#x5BFC;&#x81F4;&#x4E0D;&#x540C;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x60C5;&#x51B5;&#x4E0B;Load Average&#x4F1A;&#x5F88;&#x9AD8;&#xFF0C;&#x4F46;&#x4E0D;&#x80FD;&#x53CD;&#x5E94;CPU&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x589E;&#x52A0;(&#x53EF;&#x80FD;CPU&#x4F7F;&#x7528;&#x7387;&#x4F1A;&#x5F88;&#x4F4E;&#xFF0C;&#x4F46;&#x662F;&#x4F9D;&#x7136;&#x53CD;&#x5E94;&#x51FA;&#x7528;&#x6237;&#x9700;&#x8981;&#x7B49;&#x5F85;&#x591A;&#x957F;&#x65F6;&#x95F4;)&#x3002;&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x662F;&#x7EDF;&#x8BA1;&#x8FDB;&#x7A0B;&#x8FD8;&#x662F;&#x7EBF;&#x7A0B;&lt;/p&gt;

&lt;p&gt;&#x5728;&#x73B0;&#x4EE3;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5BF9;&#x7EBF;&#x7A0B;&#x7684;&#x4E0D;&#x540C;&#x5B9E;&#x73B0;&#x5BFC;&#x81F4;Load Average&#x8BA1;&#x7B97;&#x7684;&#x4E0D;&#x540C;&#x3002;&#x8FD9;&#x5B9E;&#x9645;&#x662F;&#x8DDF;&#x4E0D;&#x540C;&#x7EBF;&#x7A0B;&#x6A21;&#x578B;&#x76F8;&#x5173;&#x7684;&#x3002;&#x4E3A;&#x4E86;&#x8BA1;&#x7B97;Load&#x4E00;&#x4E9B;&#x7CFB;&#x7EDF;&#x89C6;&#x7EBF;&#x7A0B;&#x4E3A;&#x8FDB;&#x7A0B;&#xFF1A;&#x90A3;&#x4E48;&#x6BCF;&#x4E2A;&#x7B49;&#x5F85;&#x7684;&#x7EBF;&#x7A0B;&#x90FD;&#x4F1A;&#x4F7F;Load&#x503C;&#x589E;1&#x3002;&#x4F46;&#x662F;&#x5176;&#x4ED6;&#x7CFB;&#x7EDF;&#x53EF;&#x80FD;&#x4E0D;&#x540C;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5BF9;&#x4E8E;&#x5B9E;&#x73B0;M:N&#x8FD9;&#x79CD;&#x7EBF;&#x7A0B;&#x6A21;&#x578B;&#x7684;&#x7CFB;&#x7EDF;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x5BF9;&#x4E8E;Load&#x8BA1;&#x7B97;&#x6709;&#x7684;&#x662F;&#x6309;&#x7167;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x6070;&#x597D;&#x4E00;&#x6B21;(&#x65E0;&#x8BBA;&#x7EBF;&#x7A0B;&#x6570;&#x91CF;)&#xFF0C;&#x6709;&#x7684;&#x662F;&#x4EC5;&#x4EC5;&#x8BA1;&#x7B97;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x8C03;&#x5EA6;&#x5668;&#x66B4;&#x9732;&#x7ED9;&#x5185;&#x6838;&#x7684;&#x7EBF;&#x7A0B;&#x6570;(&#x8FD9;&#x53EF;&#x80FD;&#x53D6;&#x51B3;&#x4E8E;&#x5904;&#x7406;&#x5668;&#x7684;&#x5E76;&#x53D1;&#x91CF;)&#x3002;Linux&#x7CFB;&#x7EDF;&#x5E94;&#x8BE5;&#x662F;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x5355;&#x72EC;Load&#x589E;1&#x3002;&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x4E00;&#x4E2A;&#x7C7B;&#x6BD4;&lt;/p&gt;

&lt;p&gt;&#x660E;&#x767D;&#x4E0A;&#x8FF0;&#x4E24;&#x70B9;&#x5C31;&#x77E5;&#x9053;&#x4E86;Load&#x8BA1;&#x7B97;&#x7684;&#x5B9E;&#x4F53;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x5173;&#x952E;&#x662F;&#x9488;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x7CFB;&#x7EDF;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x73B0;&#x3002;&#x5BF9;&#x4E8E;Load&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x5728;&lt;a href="http://blog.scoutapp.com/articles/2009/07/31/understanding-load-averages"&gt;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&lt;/a&gt;&#x4E2D;&#x6709;&#x4E2A;&#x901A;&#x4FD7;&#x7684;&#x89E3;&#x91CA;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x4E00;&#x53EA;&#x5355;&#x6838;&#x7684;&#x5904;&#x7406;&#x5668;&#x53EF;&#x4EE5;&#x6BD4;&#x55BB;&#x6210;&#x4E00;&#x6761;&#x5355;&#x8F66;&#x9053;&#x3002;&#x8BBE;&#x60F3;&#x4F60;&#x662F;&#x8FD9;&#x6761;&#x9053;&#x8DEF;&#x7684;&#x4EA4;&#x8B66;&#xFF0C;&#x4F60;&#x6765;&#x89C4;&#x5212;&#x8F66;&#x8F86;&#x600E;&#x4E48;&#x901A;&#x8FC7;&#x3002;&#x5982;&#x679C;&#x524D;&#x9762;&#x6CA1;&#x6709;&#x8F66;&#x8F86;&#x5728;&#x7B49;&#x5F85;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x53EF;&#x4EE5;&#x544A;&#x8BC9;&#x540E;&#x9762;&#x7684;&#x53F8;&#x673A;&#x901A;&#x8FC7;&#x3002; &#x5982;&#x679C;&#x8F66;&#x8F86;&#x4F17;&#x591A;&#xFF0C;&#x90A3;&#x4E48;&#x9700;&#x8981;&#x544A;&#x8BC9;&#x4ED6;&#x4EEC;&#x7A0D;&#x7B49;&#x4E00;&#x4F1A;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x4E8E;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x8F66;&#x6D41;&#x60C5;&#x51B5;&#x6709;&#x7279;&#x5B9A;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;&lt;/p&gt;

&lt;p&gt;0.00 &#x8868;&#x793A;&#x76EE;&#x524D;&#x9053;&#x8DEF;&#x4E0A;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x7684;&#x8F66;&#x6D41;&#x3002; &#x5B9E;&#x9645;&#x4E0A;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0E; 0.00 &#x5230; 1.00 &#x4E4B;&#x95F4;&#x662F;&#x76F8;&#x540C;&#x7684;&#xFF0C;&#x5F88;&#x901A;&#x7545;&#xFF0C;&#x8FC7;&#x5F80;&#x7684;&#x8F66;&#x8F86;&#x53EF;&#x4EE5;&#x4E1D;&#x6BEB;&#x4E0D;&#x7528;&#x7B49;&#x5F85;&#x7684;&#x901A;&#x8FC7;&#x3002;&lt;/p&gt;

&lt;p&gt;1.00 &#x8868;&#x793A;&#x521A;&#x597D;&#x662F;&#x5728;&#x8FD9;&#x6761;&#x9053;&#x8DEF;&#x7684;&#x627F;&#x53D7;&#x8303;&#x56F4;&#x5185;&#x3002; &#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0D;&#x7B97;&#x7CDF;&#x7CD5;&#xFF0C;&#x53EA;&#x662F;&#x8F66;&#x6D41;&#x4F1A;&#x6709;&#x4E9B;&#x5835;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x53EF;&#x80FD;&#x4F1A;&#x9020;&#x6210;&#x4EA4;&#x901A;&#x8D8A;&#x6765;&#x8D8A;&#x6162;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x8D85;&#x8FC7; 1.00&#xFF0C;&#x90A3;&#x4E48;&#x8BF4;&#x660E;&#x8FD9;&#x6761;&#x9053;&#x8DEF;&#x5DF2;&#x7ECF;&#x8D85;&#x51FA;&#x8D1F;&#x8377;&#xFF0C;&#x4EA4;&#x901A;&#x4E25;&#x91CD;&#x7684;&#x62E5;&#x5835;&#x3002; &#x90A3;&#x4E48;&#x60C5;&#x51B5;&#x6709;&#x591A;&#x7CDF;&#x7CD5;&#xFF1F; &#x4F8B;&#x5982; 2.00 &#x7684;&#x60C5;&#x51B5;&#x8BF4;&#x660E;&#x8F66;&#x6D41;&#x5DF2;&#x7ECF;&#x8D85;&#x51FA;&#x4E86;&#x6865;&#x6240;&#x80FD;&#x627F;&#x53D7;&#x7684;&#x4E00;&#x500D;&#xFF0C;&#x90A3;&#x4E48;&#x5C06;&#x6709;&#x591A;&#x4F59;&#x8FC7;&#x6865;&#x4E00;&#x500D;&#x7684;&#x8F66;&#x8F86;&#x6B63;&#x5728;&#x7126;&#x6025;&#x7684;&#x7B49;&#x5F85;&#x3002;3.00 &#x7684;&#x8BDD;&#x60C5;&#x51B5;&#x5C31;&#x66F4;&#x4E0D;&#x5999;&#x4E86;&#xFF0C;&#x8BF4;&#x660E;&#x8FD9;&#x6761;&#x9053;&#x8DEF;&#x57FA;&#x672C;&#x4E0A;&#x5DF2;&#x7ECF;&#x5FEB;&#x627F;&#x53D7;&#x4E0D;&#x4E86;&#xFF0C;&#x8FD8;&#x6709;&#x8D85;&#x51FA;&#x9053;&#x8DEF;&#x8D1F;&#x8F7D;&#x4E24;&#x500D;&#x591A;&#x7684;&#x8F66;&#x8F86;&#x6B63;&#x5728;&#x7B49;&#x5F85;&#x901A;&#x8FC7;&#x3002;&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x4E24;&#x4E2A;&#x6BD4;&#x8F83;&lt;/p&gt;

&lt;p&gt;Load Average&#x662F;&#x7CFB;&#x7EDF;&#x8D1F;&#x8377;&#x7684;&#x91CD;&#x8981;&#x5EA6;&#x91CF;&#x6307;&#x6807;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x540C;&#x6837;&#x7ECF;&#x5E38;&#x88AB;&#x4F7F;&#x7528;&#x7684;&#x5219;&#x662F;CPU&#x4F7F;&#x7528;&#x7387;&#x3002;&#x8FD9;&#x91CC;&#x7B80;&#x5355;&#x7684;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x3002;&lt;/p&gt;

&lt;ul&gt;
&lt;li&gt;Load Average&#x5EA6;&#x91CF;&#x7684;&#x662F;CPU&#x4F7F;&#x7528;&#x7684;&#x8D8B;&#x52BF;&#xFF0C;&#x800C;&#x4E0D;&#x50CF;CPU&#x4F7F;&#x7528;&#x7387;&#x90A3;&#x6837;&#x662F;&#x77AC;&#x65F6;&#x5FEB;&#x7167;&lt;/li&gt;
&lt;li&gt;Load Average&#x5305;&#x542B;&#x4E86;&#x6240;&#x6709;&#x5BF9;CPU&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x5EA6;&#x91CF;&#x65F6;&#x95F4;&#x70B9;&#x7684;&#x6D3B;&#x8DC3;&#x7A0B;&#x5EA6;&lt;/li&gt;
&lt;/ul&gt;

&lt;p&gt;&#x5BF9;&#x4E8E;&#x5747;&#x8861;&#x8D1F;&#x8F7D;&#x6765;&#x8BF4;&#xFF0C;&#x57FA;&#x4E8E;CPU&#x961F;&#x5217;&#x957F;&#x5EA6;&#x7684;CPU Load&#x4FE1;&#x606F;&#x4F1A;&#x6BD4;CPU&#x4F7F;&#x7528;&#x7387;&#x66F4;&#x597D;&#x3002;&#x539F;&#x56E0;&#x5927;&#x6982;&#x662F;&#x5BF9;&#x4E8E;Load&#x5F88;&#x9AD8;&#x7684;&#x4E3B;&#x673A;&#xFF0C;CPU&#x4F7F;&#x7528;&#x7387;&#x53EF;&#x80FD;&#x63A5;&#x8FD1;100%&#xFF0C;&#x8FD9;&#x65F6;&#x7684;&#x5229;&#x7528;&#x7387;&#x4E0D;&#x80FD;&#x53CD;&#x5E94;&#x8D1F;&#x8F7D;&#x7684;&#x7EA7;&#x522B;&#x3002;&#x76F8;&#x53CD;&#xFF0C;CPU&#x961F;&#x5217;&#x957F;&#x5EA6;&#x80FD;&#x76F4;&#x63A5;&#x53CD;&#x5E94;&#x8FD9;&#x4E2A;CPU&#x7684;&#x8D1F;&#x8F7D;&#x603B;&#x91CF;&#x3002;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#x5C31;&#x662F;&#xFF1A;&#x5BF9;&#x4E8E;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E00;&#x4E2A;&#x6709;3&#x4E2A;&#x8FDB;&#x7A0B;&#x5728;&#x7B49;&#x5F85;&#x961F;&#x5217;&#x4E00;&#x4E2A;&#x6709;6&#x4E2A;&#x8FDB;&#x7A0B;&#x5728;&#x961F;&#x5217;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;CPU&#x5229;&#x7528;&#x7387;&#x90FD;&#x53EF;&#x80FD;&#x63A5;&#x8FD1;100%&#x3002;&lt;/p&gt;

&lt;p&gt;&#x5BF9;&#x4E8E;CPU&#x5229;&#x7528;&#x7387;&#x548C;CPU Load Average&#x7684;&#x7ED3;&#x679C;&#x6765;&#x5224;&#x65AD;&#x6027;&#x80FD;&#x95EE;&#x9898;&#x3002;&#x9996;&#x5148;&#x4F4E;CPU&#x5229;&#x7528;&#x7387;&#x4E0D;&#x8868;&#x660E;CPU&#x4E0D;&#x662F;&#x74F6;&#x9888;&#xFF0C;&#x7ADE;&#x4E89;CPU&#x7684;&#x961F;&#x5217;&#x957F;&#x671F;&#x4FDD;&#x6301;&#x8F83;&#x957F;&#x4E5F;&#x662F;CPU&#x8D85;&#x8D1F;&#x8377;&#x7684;&#x4E00;&#x79CD;&#x8868;&#x73B0;&#x3002;&#x5BF9;&#x4E8E;&#x5E94;&#x7528;&#x6765;&#x8BF4;&#x53EF;&#x80FD;&#x4F1A;&#x53BB;&#x82B1;&#x65F6;&#x95F4;&#x5728;I/O,Socket&#x7B49;&#x65B9;&#x9762;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x662F;&#x5426;&#x540E;&#x8FD9;&#x4E9B;&#x786C;&#x4EF6;&#x7684;&#x901F;&#x5EA6;&#x5F71;&#x54CD;&#x4E86;&#x6574;&#x4F53;&#x7684;&#x6548;&#x7387;&#x3002;&lt;/p&gt;

&lt;hr&gt;&lt;/li&gt;
&lt;/ul&gt;

&lt;h3 id="toc_1"&gt;when&lt;/h3&gt;

&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x6CE8;&#x610F;Load Average&lt;/p&gt;

&lt;p&gt;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x8D1F;&#x8F7D;&#x662F;&#x7406;&#x60F3;&#x8D1F;&#x8F7D;, 1.00&#x5C31;&#x5F88;&#x7406;&#x60F3;&#x5417;&#x3002;&#x6709;&#x7ECF;&#x9A8C;&#x7684;&#x7BA1;&#x7406;&#x5458;&#x628A;&#x7406;&#x60F3;&#x8D1F;&#x8F7D;&#x8BBE;&#x5728;0.7&#x3002;&#x4E8E;&#x662F;&#x6709;&#x4E86;&#x5355;&#x6838;&#x5904;&#x7406;&#x5668;&#x4E09;&#x4E2A;&#x51C6;&#x5219;&#x3002;&#x5BF9;&#x4E8E;&#x591A;&#x6838;(&#x591A;&#x5904;&#x7406;&#x5668;&#x3001;&#x591A;&#x6838;&#x6570;)&#x9700;&#x8981;&#x7528;Load&#x6765;&#x9664;&#x4EE5;&#x603B;&#x6838;&#x6570;&#x3002;&#x7136;&#x540E;&#x6309;&#x7167;&#x5355;&#x6838;&#x7684;&#x6807;&#x51C6;&#x6765;&#x770B;&#x3002;&lt;/p&gt;

&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&#x5355;&#x6838;&lt;/p&gt;

&lt;ul&gt;
&lt;li&gt;&#x5F53;&#x7CFB;&#x7EDF;&#x8D1F;&#x8377;&#x6301;&#x7EED;&#x5927;&#x4E8E;0.7&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x5F00;&#x59CB;&#x8C03;&#x67E5;&#x4E86;&#xFF0C;&#x95EE;&#x9898;&#x51FA;&#x5728;&#x54EA;&#x91CC;&#xFF0C;&#x9632;&#x6B62;&#x60C5;&#x51B5;&#x6076;&#x5316;&#x3002;&lt;/li&gt;
&lt;li&gt;&#x5F53;&#x7CFB;&#x7EDF;&#x8D1F;&#x8377;&#x6301;&#x7EED;&#x5927;&#x4E8E;1.0&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x52A8;&#x624B;&#x5BFB;&#x627E;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#xFF0C;&#x628A;&#x8FD9;&#x4E2A;&#x503C;&#x964D;&#x4E0B;&#x6765;&#x3002;&lt;/li&gt;
&lt;li&gt;&#x5F53;&#x7CFB;&#x7EDF;&#x8D1F;&#x8377;&#x8FBE;&#x5230;5.0&#xFF0C;&#x5C31;&#x8868;&#x660E;&#x4F60;&#x7684;&#x7CFB;&#x7EDF;&#x6709;&#x5F88;&#x4E25;&#x91CD;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x957F;&#x65F6;&#x95F4;&#x6CA1;&#x6709;&#x54CD;&#x5E94;&#xFF0C;&#x6216;&#x8005;&#x63A5;&#x8FD1;&#x6B7B;&#x673A;&#x4E86;&#x3002;&#x4F60;&#x4E0D;&#x5E94;&#x8BE5;&#x8BA9;&#x7CFB;&#x7EDF;&#x8FBE;&#x5230;&#x8FD9;&#x4E2A;&#x503C;&#x3002;&lt;/li&gt;
&lt;/ul&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x591A;&#x6838;&lt;/p&gt;

&lt;ul&gt;
&lt;li&gt;&#x591A;&#x6838;CPU&#x4E0E;&#x591A;CPU&#x6548;&#x679C;&#x7C7B;&#x4F3C;&#xFF0C;&#x6240;&#x4EE5;&#x8003;&#x8651;&#x7CFB;&#x7EDF;&#x8D1F;&#x8377;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5FC5;&#x987B;&#x8003;&#x8651;&#x8FD9;&#x53F0;&#x7535;&#x8111;&#x6709;&#x51E0;&#x4E2A;CPU&#x3001;&#x6BCF;&#x4E2A;CPU&#x6709;&#x51E0;&#x4E2A;&#x6838;&#x5FC3;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x628A;&#x7CFB;&#x7EDF;&#x8D1F;&#x8377;&#x9664;&#x4EE5;&#x603B;&#x7684;&#x6838;&#x5FC3;&#x6570;&#xFF0C;&#x53EA;&#x8981;&#x6BCF;&#x4E2A;&#x6838;&#x5FC3;&#x7684;&#x8D1F;&#x8377;&#x4E0D;&#x8D85;&#x8FC7;1.0&#xFF0C;&#x5C31;&#x8868;&#x660E;&#x7535;&#x8111;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#x3002;&lt;/li&gt;
&lt;/ul&gt;&lt;/li&gt;
&lt;/ul&gt;&lt;/li&gt;
&lt;/ul&gt;

&lt;hr&gt;

&lt;h3 id="toc_2"&gt;where&lt;/h3&gt;

&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&#x54EA;&#x4E9B;&#x5730;&#x65B9;&#x6709;Load Average&lt;/p&gt;

&lt;ul&gt;
&lt;li&gt;w&lt;/li&gt;
&lt;li&gt;uptime&lt;/li&gt;
&lt;li&gt;top&lt;/li&gt;
&lt;li&gt;htop&lt;/li&gt;
&lt;li&gt;iftop&lt;/li&gt;
&lt;li&gt;vmstat&lt;/li&gt;
&lt;li&gt;iostat&lt;/li&gt;
&lt;li&gt;mpstat&lt;/li&gt;
&lt;li&gt;netstat&lt;/li&gt;
&lt;li&gt;dstat&lt;/li&gt;
&lt;li&gt;xload&lt;/li&gt;
&lt;li&gt;tload&lt;/li&gt;
&lt;li&gt;/proc/loadavg&lt;/li&gt;
&lt;/ul&gt;&lt;/li&gt;
&lt;/ul&gt;

&lt;hr&gt;

&lt;h3 id="toc_3"&gt;refenerce&lt;/h3&gt;

&lt;ul&gt;
&lt;li&gt;&lt;a href="http://en.wikipedia.org/wiki/Load_(computing)"&gt;http://en.wikipedia.org/wiki/Load_(computing)&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href="http://blog.scoutapp.com/articles/2009/07/31/understanding-load-averages"&gt;http://blog.scoutapp.com/articles/2009/07/31/understanding-load-averages&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href="http://www.linuxjournal.com/article/9001"&gt;http://www.linuxjournal.com/article/9001&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href="http://www.teamquest.com/pdfs/whitepaper/ldavg1.pdf"&gt;http://www.teamquest.com/pdfs/whitepaper/ldavg1.pdf&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
</description>
    </item>
    <item>
      <title>Getting Started With Vagrant/Coreos/Docker</title>
      <link>http://junqili.com/devops/getting-started-with-vagrant-coreos-docker</link>
      <pubDate>2014-05-17</pubDate>
      <description>&lt;p&gt;&#x8FD9;&#x662F;&#x4E00;&#x7BC7;&#x5173;&#x4E8E;Vagrant, CoreOS, Docker&#x4E09;&#x4E2A;&#x5DE5;&#x5177;&#x7684;&#x5165;&#x95E8;&#x4ECB;&#x7ECD;&#x6027;&#x6587;&#x7AE0;&#xFF0C;&#x901A;&#x8FC7;&#x63CF;&#x8FF0;&amp;quot;&#x4F7F;&#x7528;Vagrant&#x5B89;&#x88C5;CoreOS&amp;quot;, &amp;quot;&#x5728;CoreOS&#x4E2D;&#x4F7F;&#x7528;Docker&amp;quot;&#x6765;&#x4ECB;&#x7ECD;&#x4E09;&#x4E2A;&#x5DE5;&#x5177;&#x7684;&#x5165;&#x95E8;&#x4F7F;&#x7528;&#x3002;&#x5F53;&#x7136;&#x8981;&#x9996;&#x5148;&#x4ECB;&#x7ECD;&#x201D;&#x5728;Mac OS X&#x4E0A;&#x8FD0;&#x884C;Vagrant&#x201D;&#x3002;&lt;/p&gt;

&lt;h3 id="toc_0"&gt;Part I: Running Vagrant On Mac OS X&lt;/h3&gt;

&lt;hr&gt;

&lt;h4 id="toc_1"&gt;Vagrant&#x7B80;&#x4ECB;&lt;/h4&gt;

&lt;p&gt;Vagrant&#x662F;&#x4E00;&#x4E2A;&#x521B;&#x5EFA;&#x548C;&#x914D;&#x7F6E;&#x8F7B;&#x91CF;&#x7EA7;&#xFF0C;&#x53EF;&#x590D;&#x5236;&#xFF0C;&#x53EF;&#x79FB;&#x690D;&#x5F00;&#x53D1;&#x73AF;&#x5883;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x8BA9;&#x914D;&#x7F6E;&#x5F00;&#x53D1;&#x73AF;&#x5883;&#x66F4;&#x5BB9;&#x6613;&#x3002;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4F7F;&#x7528;&#x6848;&#x4F8B;&#x5C31;&#x662F;&#x901A;&#x8FC7;vagrant&#x5C01;&#x88C5;&#x4E00;&#x4E2A;Linux&#x5F00;&#x53D1;&#x73AF;&#x5883;&#xFF0C;&#x5206;&#x53D1;&#x7ED9;&#x56E2;&#x961F;&#x6210;&#x5458;&#x3002;&#x800C;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x81EA;&#x5DF1;&#x559C;&#x6B22;&#x7684;&#x684C;&#x9762;&#x7CFB;&#x7EDF;(Mac/Win/Linux)&#x4E0A;&#x5F00;&#x53D1;&#x7A0B;&#x5E8F;&#xFF0C;&#x4EE3;&#x7801;&#x5374;&#x80FD;&#x5728;&#x5C01;&#x88C5;&#x597D;&#x7684;&#x73AF;&#x5883;&#x91CC;&#x8FD0;&#x884C;&#x3002;&#x5F97;&#x76CA;&#x4E8E;&#x4E0B;&#x9762;&#x51E0;&#x4E2A;&#x7279;&#x70B9;&#xFF0C;Vagrant&#x5C06;&#x6781;&#x5927;&#x6539;&#x53D8;&#x6211;&#x4EEC;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x3002;&lt;/p&gt;

&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&#x5FEB;&#x901F;&#x5B89;&#x88C5;&lt;/p&gt;

&lt;p&gt;&#x4E0B;&#x8F7D;&#x548C;&#x5B89;&#x88C5;Vagrant&#x975E;&#x5E38;&#x5FEB;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x5728;MacOS X&#xFF0C; Windows&#x6216;&#x8005;&#x5176;&#x4ED6;&#x6D41;&#x884C;&#x7684;Linux&#x53D1;&#x884C;&#x7248;&#xFF0C;&#x4EC5;&#x9700;&#x6570;&#x5206;&#x949F;&#x65F6;&#x95F4;&#x3002;&#x6CA1;&#x6709;&#x590D;&#x6742;&#x7684;&#x5B89;&#x88C5;&#x8FC7;&#x7A0B;&#xFF0C;&#x4EC5;&#x4EC5;&#x662F;&#x7B80;&#x5355;&#x7684;&#x4F7F;&#x7528;&#x7CFB;&#x7EDF;&#x6807;&#x51C6;&#x5B89;&#x88C5;&#x5DE5;&#x5177;&#x3002;&#x5FEB;&#x901F;&#x800C;&#x4E14;&#x8DE8;&#x5E73;&#x53F0;&#x3002;&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x6781;&#x7B80;&#x914D;&#x7F6E;&lt;/p&gt;

&lt;p&gt;Vagrant&#x9879;&#x76EE;&#x552F;&#x4E00;&#x914D;&#x7F6E;&#x6587;&#x4EF6;Vagrantfile&#x63CF;&#x8FF0;&#x9700;&#x8981;&#x7684;&#x673A;&#x5668;&#x7C7B;&#x578B;&#xFF0C;&#x9700;&#x8981;&#x5B89;&#x88C5;&#x7684;&#x8F6F;&#x4EF6;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x8BBF;&#x95EE;&#x8BE5;&#x673A;&#x5668;&#x7B49;&#x3002;&#x652F;&#x6301;Puppet , Chef, Shell&#x7B49;&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#xFF0C;&#x6E05;&#x5355;&#x6587;&#x4EF6;&#x53EF;&#x901A;&#x8FC7;&#x540C;&#x6B65;&#x76EE;&#x5F55;&#x5B9E;&#x73B0;&#x3002;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5373;&#x4EE3;&#x7801;&#x3002;&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x5DE5;&#x4F5C;&#x7B80;&#x5355;&lt;/p&gt;

&lt;p&gt;&#x8FD0;&#x884C;&#x547D;&#x4EE4;&#x201D;vagrant up&amp;quot;&#x5373;&#x53EF;&#x542F;&#x52A8;&#x673A;&#x5668;&#xFF0C;vagrant&#x4F1A;&#x5C06;&#x6240;&#x6709;&#x914D;&#x7F6E;&#x7EC4;&#x5408;&#x5B8C;&#x6210;&#x5B8C;&#x6574;&#x5F00;&#x53D1;&#x73AF;&#x5883;&#x914D;&#x7F6E;&#x3002;&#x201D;&#x4EE3;&#x7801;&#x5728;&#x6211;&#x673A;&#x5B50;&#x4E0A;&#x8FD0;&#x884C;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#x201D;&#x8FD9;&#x79CD;&#x8BF4;&#x8F9E;&#x5C06;&#x6210;&#x4E3A;&#x5386;&#x53F2;&#xFF0C;&#x56E0;&#x4E3A;vagrant&#x4E3A;&#x56E2;&#x961F;&#x4E2D;&#x6BCF;&#x4E2A;&#x4EBA;&#x521B;&#x5EFA;&#x4E86;&#x7EDF;&#x4E00;&#x5F00;&#x53D1;&#x73AF;&#x5883;&#x3002;&lt;/p&gt;&lt;/li&gt;
&lt;/ul&gt;

&lt;hr&gt;

&lt;h4 id="toc_2"&gt;Vagrant&#x5B89;&#x88C5;&lt;/h4&gt;

&lt;p&gt;Vagrant&#x7684;&#x5F3A;&#x5927;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x6E90;&#x4E8E;&#x5979;&#x7AD9;&#x5728;&#x5DE8;&#x4EBA;&#x7684;&#x80A9;&#x8180;&#x4E4B;&#x4E0A;&#xFF0C;&#x5979;&#x5E76;&#x4E0D;&#x63D0;&#x4F9B;&#x865A;&#x62DF;&#x5316;&#x7684;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#xFF0C;&#x800C;&#x662F;&#x501F;&#x52A9;Providers&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x6700;&#x521D;&#x7684;Provider&#x662F;VirtualBox&#xFF0C;&#x540E;&#x6765;&#x652F;&#x6301;&#x4E86;VMware&#xFF0C; AWS&#x7B49;&#x3002;&#x5728;&#x8FD9;&#x4E4B;&#x4E0A;&#xFF0C;&#x901A;&#x8FC7;Puppet, Chef,  Shell&#x6765;&#x5B9E;&#x73B0;&#x8F6F;&#x4EF6;&#x5B89;&#x88C5;&#x4E0E;&#x914D;&#x7F6E;&#x3002;Vagrant&#x5C31;&#x662F;&#x865A;&#x673A;&#x7BA1;&#x7406;&#x5DE5;&#x5177; &#x3002;&lt;/p&gt;

&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&#x5B89;&#x88C5;VirtualBox&#x4E0E;Vagrant &lt;/p&gt;

&lt;p&gt;&#x9009;&#x62E9;&#x5F00;&#x6E90;VirtualBox&#x4F5C;&#x4E3A;Provider&#xFF0C;&#x5C0F;&#x5DE7;&#x514D;&#x8D39;&#xFF0C;&#x4E0B;&#x8F7D;&#x5B89;&#x88C5;&#x5F88;&#x7B80;&#x5355;&#x3002;&lt;a href="https://www.virtualbox.org/wiki/Downloads"&gt;&#x4F20;&#x9001;&#x95E8;&lt;/a&gt;&lt;/p&gt;

&lt;p&gt;&#x540C;&#x6837;Vagrant&#x5B89;&#x88C5;&#x4E5F;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x652F;&#x6301;Mac, Win&#x548C;&#x5E38;&#x89C1;Linux&#x53D1;&#x884C;&#x7248;&#x3002;&lt;a href="http://www.vagrantup.com/downloads.html"&gt;&#x4F20;&#x9001;&#x95E8;&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x955C;&#x50CF;&#x4E0B;&#x8F7D;&#x4E0E;&#x6DFB;&#x52A0;&lt;/p&gt;

&lt;p&gt;&#x9700;&#x8981;&#x4E0B;&#x8F7D;&#x57FA;&#x7840;&#x955C;&#x50CF;&#x6587;&#x4EF6;&#x3002;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4E0B;&#x8F7D;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x547D;&#x4EE4;box add&#x4E0B;&#x8F7D;&#xFF0C;&#x5728;&lt;a href="http://www.vagrantbox.es/"&gt;&#x8FD9;&#x91CC;&lt;/a&gt;&#x6709;&#x5F88;&#x591A;&#x955C;&#x50CF;&#x3002;&lt;/p&gt;

&lt;pre&gt;&lt;code&gt;vagrant box add centos https://github.com/2creatives/vagrant-centos/releases/download/v6.5.1/centos65-x86_64-20131205.box

centos &#x662F;box&#x540D;&#x5B57; &#x94FE;&#x63A5;&#x662F;box&#x955C;&#x50CF;&#x4E0B;&#x8F7D;&#x5730;&#x5740;&#xFF0C;&#x5982;&#x679C;&#x5DF2;&#x7ECF;&#x4E0B;&#x8F7D;&#xFF0C;&#x53EF;&#x76F4;&#x63A5;&#x6307;&#x5B9A;&#x6587;&#x4EF6;&#x8DEF;&#x5F84;
&lt;/code&gt;&lt;/pre&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x73AF;&#x5883;&#x521D;&#x59CB;&#x5316;&lt;/p&gt;

&lt;p&gt;&#x521D;&#x59CB;&#x5316;&#x73AF;&#x5883;&#x3002;&lt;/p&gt;

&lt;pre&gt;&lt;code&gt;cd ~/vagrant
vagrant init centos
&lt;/code&gt;&lt;/pre&gt;

&lt;p&gt;&#x542F;&#x52A8;&#x73AF;&#x5883;&lt;/p&gt;

&lt;pre&gt;&lt;code&gt;vagrant up
&lt;/code&gt;&lt;/pre&gt;

&lt;p&gt;&#x767B;&#x5F55;&#x73AF;&#x5883;&lt;/p&gt;

&lt;pre&gt;&lt;code&gt;vagrant ssh
&lt;/code&gt;&lt;/pre&gt;

&lt;p&gt;&#x6CE8; &#xFF1A;&#x521D;&#x59CB;&#x5316;&#x5B8C;&#x6210;&#x4F1A;&#x63D0;&#x793A;&#x5728;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x751F;&#x6210;&#x6587;&#x4EF6;Vagrantfile, &#x8FD9;&#x662F;&#x6574;&#x4E2A;&#x9879;&#x76EE;&#x552F;&#x4E00;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x6CE8;&#xFF1A;&#x542F;&#x52A8;&#x8FC7;&#x7A0B;&#x5927;&#x81F4;&#x9636;&#x6BB5;&#xFF1A;&#x68C0;&#x67E5;&#x914D;&#x7F6E; &#x2014; &#x8BBE;&#x7F6E;&#x7F51;&#x5361; &#x2014; &#x542F;&#x52A8;&#x7CFB;&#x7EDF; &#x2014; &#x914D;&#x7F6E;&#x7F51;&#x7EDC; &#x2014; &#x5176;&#x4ED6;&#x914D;&#x7F6E;&#x2014; &#x5171;&#x4EAB;&#x76EE;&#x5F55; &#x5176;&#x5B9E;&#x672C;&#x8D28;&#x662F;&#x5BF9;VirtualBox&#x914D;&#x7F6E;&#x548C;&#x542F;&#x52A8;&#x8FC7;&#x7A0B;&#x7684;&#x5C01;&#x88C5;&lt;/p&gt;

&lt;p&gt;&#x5230;&#x6B64;&#x4E3A;&#x6B62;&#xFF0C;&#x5F00;&#x53D1;&#x73AF;&#x5883;&#x5C31;&#x5DF2;&#x7ECF;&#x51C6;&#x5907;&#x5C31;&#x7EEA;&#xFF0C;&#x5E76;&#x4E14;&#x5DF2;&#x7ECF;&#x767B;&#x5F55;&#x5B8C;&#x6210;&#x3002;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x548C;&#x540E;&#x7EED;&#x914D;&#x7F6E;&#x3002;&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x76F8;&#x5173;&#x8BBE;&#x7F6E;&#x9879;&lt;/p&gt;

&lt;p&gt;&#x8FD9;&#x91CC;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#x6765;&#x63CF;&#x8FF0;&#x51E0;&#x4E2A;&#x5E38;&#x89C1;&#x914D;&#x7F6E;&#x9879;&#x3002;&#x60C5;&#x666F;&#x4E3E;&#x4F8B;&#xFF1A;&#x5728;&#x642D;&#x5EFA;&#x597D;&#x7684;&#x73AF;&#x5883;&#x5B89;&#x88C5;Nginx&#x5F00;&#x53D1;&#x73AF;&#x5883;&#xFF0C;&#x5E76;&#x4E14;&#x786E;&#x4FDD;&#x901A;&#x8FC7;LocalHost&#x548C;&#x5F00;&#x53D1;&#x673A;IP&#x90FD;&#x53EF;&#x8BBF;&#x95EE;&#xFF0C;&#x80FD;&#x591F;&#x5728;&#x672C;&#x673A;&#x63D0;&#x4F9B;Index&#x9875;&#x9762;&#x8986;&#x76D6;Nginx&#x9ED8;&#x8BA4;Index&#x9875;&#x9762;&#x3002;&lt;/p&gt;

&lt;ul&gt;
&lt;li&gt;&lt;p&gt;SSH&#x767B;&#x4E0A;&#x5F00;&#x53D1;&#x673A;&#xFF0C;&#x4F7F;&#x7528;Yum&#x5B89;&#x88C5;Nginx, &#x7136;&#x540E;&#x8D77;&#x670D;&#x52A1;&#x3002;&lt;/p&gt;

&lt;pre&gt;&lt;code&gt;vagrant ssh
sudo yum install -y nginx
sudo service nginx start
&lt;/code&gt;&lt;/pre&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;Vagrant&#x9ED8;&#x8BA4;&#x4F7F;&#x7528;NAT&#x65B9;&#x5F0F;&#xFF0C;&#x5C06;&#x865A;&#x673A;&#x7AEF;&#x53E3;&#x6620;&#x5C04;&#x5230;&#x672C;&#x5730;&#x7AEF;&#x53E3;&#x3002;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;HOST&lt;em&gt;ONLY&#x65B9;&#x5F0F;&#xFF0C;&#x4FEE;&#x6539;&#x914D;&#x7F6E;&#x9879;&#xFF1A;config.vm.network &amp;quot;private&lt;/em&gt;network&amp;quot;, ip: &#x201C;192.168.33.11&amp;quot; &#x8FD9;&#x6837;&#x5F00;&#x53D1;&#x673A;&#x5C31;&#x6709;&#x4E86;IP&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x4FEE;&#x6539;&#x7AEF;&#x53E3;&#x6620;&#x5C04;&#x914D;&#x7F6E;&#x9879;&#xFF1A;config.vm.network &amp;quot;forwarded_port&amp;quot;, guest: 80, host: 8000 &#x5F53;&#x7136;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x66F4;&#x591A;&#x7684;&#x7AEF;&#x53E3;&#x6620;&#x5C04;&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x4FEE;&#x6539;&#x540C;&#x6B65;&#x6587;&#x4EF6;&#x914D;&#x7F6E;&#x9879;&#xFF1A;config.vm.synced_folder &amp;quot;html&amp;quot;, &amp;quot;/usr/share/nginx/html&amp;quot;, owner: &amp;quot;root&amp;quot;, group: &amp;quot;root&amp;quot;, create: true &#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x5728;html&#x76EE;&#x5F55;&#x4E0B;&#x653E;&#x7F6E;Nginx&#x9700;&#x8981;&#x7684;&#x6587;&#x4EF6;&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x91CD;&#x542F;&#x673A;&#x5668;&#x4F7F;&#x914D;&#x7F6E;&#x751F;&#x6548;:&lt;/p&gt;

&lt;pre&gt;&lt;code&gt;vagrant reload
echo testing &amp;gt;  html/index.html
curl http://192.168.33.11/ /curl http://localhost:8000/ 
&lt;/code&gt;&lt;/pre&gt;&lt;/li&gt;
&lt;/ul&gt;&lt;/li&gt;
&lt;/ul&gt;

&lt;hr&gt;

&lt;h4 id="toc_3"&gt;Vagrant&#x4F7F;&#x7528;&lt;/h4&gt;

&lt;ul&gt;
&lt;li&gt;&lt;p&gt;Vagrant&#x673A;&#x5668;&#x751F;&#x547D;&#x5468;&#x671F;&#x7BA1;&#x7406;&#xFF1A;&lt;/p&gt;

&lt;pre&gt;&lt;code&gt;init - up - ssh - suspend - resume - reload -  halt - destroy
&lt;/code&gt;&lt;/pre&gt;

&lt;p&gt;&lt;img src="/assets/media/docker/vagrant1.png" alt="&#x56FE;1"&gt;&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;Vagrant Cloud&#x4E0E;Git&#x5DE5;&#x4F5C;&#x6D41;&#x5BF9;&#x7167;&lt;/p&gt;

&lt;pre&gt;&lt;code&gt;login - init - package - share
&lt;/code&gt;&lt;/pre&gt;

&lt;p&gt;&lt;img src="/assets/media/docker/vagrant2.png" alt="&#x56FE;2"&gt;&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x5176;&#x4ED6;&#x547D;&#x4EE4;&lt;/p&gt;

&lt;ul&gt;
&lt;li&gt;&lt;p&gt;init/box: &lt;/p&gt;

&lt;pre&gt;&lt;code&gt;vagrant init lsomeoe/centos = vagrant box add centos image_link + vagrant init centos
&lt;/code&gt;&lt;/pre&gt;

&lt;p&gt;Vagrant Cloud&#x5141;&#x8BB8;&#x6240;&#x6709;&#x4EBA;&#x5206;&#x4EAB;&#x81EA;&#x5DF1;&#x7684;Vagrantfile, &#x7C7B;&#x4F3C;GitHub&#x5F0F;&#x6258;&#x7BA1;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x3002;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;init&#x5728;VagrantCloud&#x4E0A;&#x6258;&#x7BA1;&#x7684;Vagrantfile&#x3002;init&#x547D;&#x4EE4;&#x4F1A;&#x5E2E;&#x52A9;&#x4E0B;&#x8F7D;&#x955C;&#x50CF;&#x5E76;&#x521D;&#x59CB;&#x5316;&#x73AF;&#x5883;&#x3002;&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;connect&lt;/p&gt;

&lt;pre&gt;&lt;code&gt;&#x5F53;&#x4F7F;&#x7528;vagrant share&#x5171;&#x4EAB;&#x73AF;&#x5883;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x901A;&#x8FC7;connect&#x547D;&#x4EE4;&#x8FDE;&#x63A5;&#x81F3;&#x5171;&#x4EAB;&#x73AF;&#x5883;&#x3002;
&lt;/code&gt;&lt;/pre&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;provision&lt;/p&gt;

&lt;pre&gt;&lt;code&gt;vagrant&#x96C6;&#x6210;&#x4E86;&#x591A;&#x79CD;&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#x5DE5;&#x5177;: Shell, Chef, Puppet&#x7B49;&#x5E38;&#x89C1;&#x65B9;&#x5F0F;&#x5747;&#x652F;&#x6301;&#x3002;
&lt;/code&gt;&lt;/pre&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;plugin&lt;/p&gt;

&lt;pre&gt;&lt;code&gt;&#x7528;&#x4EE5;&#x7BA1;&#x7406;&#x63D2;&#x4EF6;&#xFF1A;&#x652F;&#x6301;&#x5982;&#x4E0B;&#x5B50;&#x547D;&#x4EE4;&#xFF1A;install. uninstall, update, list, lisence
&lt;/code&gt;&lt;/pre&gt;&lt;/li&gt;
&lt;/ul&gt;&lt;/li&gt;
&lt;/ul&gt;

&lt;hr&gt;

&lt;h4 id="toc_4"&gt;&#x9047;&#x5230;&#x95EE;&#x9898;&lt;/h4&gt;

&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&#x7F16;&#x7801;&#x95EE;&#x9898;&lt;/p&gt;

&lt;pre&gt;&lt;code&gt;vagrant ssh
Welcome to Ubuntu 12.04.4 LTS (GNU/Linux 3.8.0-39-generic x86_64)
Documentation:  https://help.ubuntu.com/
Last login: Sat May  3 09:02:01 2014 from 10.0.2.2
-bash: warning: setlocale: LC_ALL: cannot change locale (zh_CN.UTF-8)
-bash: warning: setlocale: LC_ALL: cannot change locale (zh_CN.UTF-8)
-bash: warning: setlocale: LC_ALL: cannot change locale (zh_CN.UTF-8)
&lt;/code&gt;&lt;/pre&gt;

&lt;p&gt;&#x539F;&#x56E0;&#x662F;&#x672C;&#x673A;&#x5668;&#x7F16;&#x7801;&#x8BBE;&#x7F6E;&#x4E3A;zh_CN.UTF-8 SSH&#x767B;&#x5F55;&#x8FC7;&#x53BB;&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x5F02;&#x5E38;&#x9519;&#x8BEF;&lt;/p&gt;

&lt;pre&gt;&lt;code&gt;Bringing machine &amp;#39;default&amp;#39; up with &amp;#39;virtualbox&amp;#39; provider...
[default] Importing base box &amp;#39;Cupcake&amp;#39;...
[default] Matching MAC address for NAT networking...
[default] Setting the name of the VM...
[default] Clearing any previously set forwarded ports...
[default] Creating shared folders metadata...
[default] Clearing any previously set network interfaces...
There was an error while executing `VBoxManage`, a CLI used by Vagrant for controlling VirtualBox. The command and stderr is shown below.
Command: [&amp;quot;hostonlyif&amp;quot;, &amp;quot;create&amp;quot;]
Stderr: 0%...
Progress state: NS_ERROR_FAILURE
VBoxManage: error: Failed to create the host-only adapter
&lt;/code&gt;&lt;/pre&gt;

&lt;p&gt;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#x5982;&#x4E0A;&#xFF1A;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#xFF1A;&lt;/p&gt;

&lt;pre&gt;&lt;code&gt;sudo /Library/StartupItems/VirtualBox/VirtualBox restart(mac os x 10.9)
sudo modprobe vboxnetadp(linux)
&lt;/code&gt;&lt;/pre&gt;

&lt;p&gt;vagrant&#x5728;&#x91CD;&#x542F;virtualbox&#x865A;&#x673A;&#x6216;&#x542F;&#x52A8;&#x865A;&#x673A;&#x65F6;&#x6709;&#x65F6;&#x5019;&#x4F1A;&#x9047;&#x5230;&#x8FD9;&#x79CD;&#x5F02;&#x5E38;&#x9000;&#x51FA;&#x3002;&#x57FA;&#x672C;&#x91CD;&#x542F;virtaulbox&#x670D;&#x52A1;&#x5373;&#x53EF;&#x3002;&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;SSH&#x522B;&#x540D;&lt;/p&gt;

&lt;p&gt;&#x65E2;&#x7136;&#x914D;&#x7F6E;&#x4E86;IP, &#x4E5F;&#x8BBE;&#x7F6E;&#x4E86;&#x7AEF;&#x53E3;&#x90A3;&#x4E48;&#x80FD;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x901A;&#x8FC7;&#x539F;&#x751F;&#x7684;SSH&#x547D;&#x4EE4;&#x767B;&#x5F55;&#xFF0C;&#x800C;&#x4E0D;&#x662F;Vagrant SSH&#x767B;&#x5F55;&#x5462;&#x3002;&#x5FC5;&#x7136;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#xFF0C;&#x5176;&#x5B9E;&#x53EA;&#x9700;&#x8981;&#x786E;&#x5B9A;&#x597D;&#x4E3B;&#x673A;&#xFF0C;&#x7AEF;&#x53E3;&#xFF0C;&#x8BC1;&#x4E66;&#x5C31;&#x884C;&#x3002; &#x53EF;&#x4EE5;&#x901A;&#x8FC7;vagrant ssh-config&#x6765;&#x67E5;&#x770B;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&lt;/p&gt;

&lt;pre&gt;&lt;code&gt;vagrant ssh-config
ssh $(vagrant ssh-config | awk &#x2018;{print &#x201C; -o &#x201C;$1&#x201D;=&#x201C;$2&amp;quot;&amp;quot;}&#x2019;) localhost

#!/bin/sh 
PORT=$(vagrant ssh-config | grep Port | grep -o &amp;#39;[0-9]\+&amp;#39;)
ssh -q \    
    -o UserKnownHostsFile=/dev/null \    
    -o StrictHostKeyChecking=no \    
    -i ~/.vagrant.d/insecure_private_key \    
    vagrant@localhost \    
    -p $PORT  $@
&lt;/code&gt;&lt;/pre&gt;&lt;/li&gt;
&lt;/ul&gt;
</description>
    </item>
    <item>
      <title>The Way To Deploy</title>
      <link>http://junqili.com/devops/the-way-to-deploy</link>
      <pubDate>2014-04-01</pubDate>
      <description>&lt;p&gt;&#x8FD9;&#x90E8;&#x5206;&#x7684;&#x6587;&#x7AE0;&#x4E3B;&#x8981;&#x804A;&#x804A;&#x90E8;&#x7F72;&#xFF0C;&#x4F5C;&#x4E3A;&#x4EA4;&#x4ED8;&#x7684;&#x91CD;&#x8981;&#x73AF;&#x8282;&#xFF0C;&#x81EA;&#x52A8;&#x5316;&#x90E8;&#x7F72;&#x4E00;&#x76F4;&#x662F;&#x6301;&#x7EED;&#x4EA4;&#x4ED8;&#x7684;&#x6838;&#x5FC3;&#x3002;&lt;/p&gt;

&lt;h2 id="toc_0"&gt;Part I: Brief Introduction To Deploy&lt;/h2&gt;

&lt;h3 id="toc_1"&gt;&#x90E8;&#x7F72;&#x7684;&#x5E38;&#x89C1;&#x65B9;&#x5F0F;&lt;/h3&gt;

&lt;p&gt;&#x81EA;&#x52A8;&#x5316;&#x90E8;&#x7F72;&#x4E3B;&#x8981;&#x5206;&#x4E24;&#x4E2A;&#x9636;&#x6BB5;&#xFF1A;&lt;/p&gt;

&lt;ol&gt;
&lt;li&gt;&#x4EE3;&#x7801;&#x5206;&#x53D1;&lt;/li&gt;
&lt;li&gt;&#x914D;&#x7F6E;&#x7BA1;&#x7406;&lt;/li&gt;
&lt;/ol&gt;

&lt;p&gt;&#x4E0B;&#x9762;&#x6765;&#x5177;&#x4F53;&#x770B;&#x770B;&#x8FD9;&#x4E9B;&#x9636;&#x6BB5;&#x4F7F;&#x7528;&#x7684;&#x5E38;&#x89C1;&#x65B9;&#x5F0F;&#x3002;&lt;/p&gt;

&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&#x4EE3;&#x7801;&#x5206;&#x53D1;&lt;/p&gt;

&lt;ul&gt;
&lt;li&gt;&#x4EE3;&#x7801;&#x4ED3;&#x5E93;CheckOut&lt;/li&gt;
&lt;/ul&gt;

&lt;p&gt;&#x76F4;&#x63A5;&#x4ECE;&#x7248;&#x672C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;CheckOut/Clone&#x6E90;&#x4EE3;&#x7801;&#x6216;&#x8005;&#x4E8C;&#x8FDB;&#x5236;&#x7A0B;&#x5E8F;&#x3002;&#x8FD9;&#x662F;&#x6700;&#x7B80;&#x5355;&#x76F4;&#x63A5;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4E5F;&#x662F;&#x4E0A;&#x7EBF;&#x7684;&#x672C;&#x8D28;&#x6240;&#x5728;&#xFF1A;&#x5C31;&#x662F;&#x628A;&#x5199;&#x597D;&#x7684;&#x6E90;&#x4EE3;&#x7801;&#x6216;&#x8005;&#x7F16;&#x8BD1;&#x597D;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x7A0B;&#x5E8F;&#x653E;&#x5728;&#x7EBF;&#x4E0A;&#x89C4;&#x8303;&#x7684;&#x8DEF;&#x5F84;&#x4E0B;&#x3002;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;SCP&#xFF0C; Rsync&#x7B49;&#x540C;&#x6B65;&#x624B;&#x6BB5;&#x8FDB;&#x884C;&#x6587;&#x4EF6;&#x7684;&#x540C;&#x6B65;&#x5206;&#x53D1;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x7B80;&#x5355;&#x76F4;&#x63A5;&#xFF0C;&#x5982;&#x679C;&#x518D;&#x8F85;&#x4EE5;&#x7C7B;P2P&#x5F0F;&#x4F20;&#x8F93;&#xFF0C;&#x540C;&#x6B65;&#x8FD8;&#x662F;&#x5F88;&#x5FEB;&#x7684;&#x3002;&#x4F46;&#x6700;&#x5927;&#x7684;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#xFF1A;1.&#x4E0D;&#x80FD;&#x89E3;&#x51B3;&#x4F9D;&#x8D56;&#xFF1B;2.&#x4E0D;&#x597D;&#x7248;&#x672C;&#x63A7;&#x5236;(&#x7EBF;&#x4E0B;&#x7EF4;&#x62A4;&#x6E90;&#x4EE3;&#x7801;&#xFF0C;&#x7EBF;&#x4E0A;&#x662F;&#x8F6F;&#x4EF6;&#x5305;)&#x3002;
+ &#x5305;&#x7BA1;&#x7406;&#x4E0E;&#x81EA;&#x5EFA;&#x6E90;&lt;/p&gt;

&lt;p&gt;&#x4E3A;&#x4E86;&#x66F4;&#x597D;&#x7684;&#x7EC4;&#x7EC7;&#x9700;&#x8981;&#x5206;&#x53D1;&#x7684;&#x4EE3;&#x7801;&#x6216;&#x8005;&#x4E8C;&#x8FDB;&#x5236;&#x6587;&#x4EF6;&#xFF0C;&#x4E8E;&#x662F;&#x5305;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#x8BDE;&#x751F;&#x4E86;&#xFF0C;&#x5C06;&#x540C;&#x6A21;&#x5757;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x914D;&#x7F6E;&#xFF0C;&#x6570;&#x636E;&#x6253;&#x5305;&#x5230;&#x540C;&#x4E00;&#x8F6F;&#x4EF6;&#x5305;&#x4E2D;&#xFF0C;&#x6A21;&#x5757;&#x7684;&#x66F4;&#x65B0;&#x56DE;&#x6EDA;&#x672C;&#x8D28;&#x662F;&#x8F6F;&#x4EF6;&#x5305;&#x7248;&#x672C;&#x7684;&#x53D8;&#x5316;&#x3002;&#x5F53;&#x7136;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x63D0;&#x9AD8;&#x5305;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#x7684;&#x6548;&#x7387;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x81EA;&#x5EFA;&#x8F6F;&#x4EF6;&#x6E90;&#xFF0C;&#x8F6F;&#x4EF6;&#x5305;&#x4E0B;&#x8F7D;&#x65F6;&#x63D0;&#x4F9B;CDN&#x52A0;&#x901F;&#x8FD9;&#x4E9B;&#x7B56;&#x7565;&#x3002;&#x5F53;&#x7136;&#x8FD9;&#x4E2A;&#x9700;&#x8981;&#x5BF9;&#x8F6F;&#x4EF6;&#x6E90;&#x5BF9;&#x89C4;&#x5212;&#x548C;&#x6539;&#x8FDB;&#xFF0C;&#x6BD4;&#x5982;&#x89E3;&#x51B3;&#x5927;&#x89C4;&#x6A21;&#x5E76;&#x53D1;&#x5B89;&#x88C5;&#x53EF;&#x80FD;&#x4F1A;&#x5931;&#x8D25;&#xFF0C;&#x589E;&#x52A0;Yum&#x63D2;&#x4EF6;&#x68C0;&#x67E5;&#x673A;&#x5236;&#x7B49;&#x3002;&#x8F6F;&#x4EF6;&#x5B89;&#x88C5;&#x7684;&#x81EA;&#x52A8;&#x5316;&#x57FA;&#x672C;&#x662F;&#x56F4;&#x7ED5;&#x8F6F;&#x4EF6;&#x5305;&#x5B89;&#x88C5;&#x8FDB;&#x884C;&#x7684;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x5173;&#x4E8E;&#x4EE3;&#x7801;&#x7684;&#x5206;&#x53D1;&#x4E3A;&#x4EC0;&#x4E48;&#x57FA;&#x4E8E;&#x8F6F;&#x4EF6;&#x5305;&#x4F1A;&#x6BD4;&#x76F4;&#x63A5;CO&#x4EE3;&#x7801;&#x6216;&#x4E8C;&#x8FDB;&#x5236;&#x6587;&#x4EF6;&#x6709;&#x4F18;&#x52BF;&#x8FD8;&#x6709;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x8BA9;&#x65B0;&#x73AF;&#x5883;&#x7684;&#x90E8;&#x7F72;&#x5982;&#x540C;&#x65B0;&#x7248;&#x672C;&#x7684;&#x66F4;&#x65B0;&#x4E00;&#x6837;&#x64CD;&#x4F5C;&#x4E0A;&#x6CA1;&#x6709;&#x5DEE;&#x5F02;&#xFF1A;&#x6CA1;&#x6709;&#x4F9D;&#x8D56;&#x56F0;&#x6270;&#xFF0C;&#x53EF;&#x4EE5;&#x589E;&#x91CF;&#x66F4;&#x65B0;&#x3002;&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x914D;&#x7F6E;&#x7BA1;&#x7406;&lt;/p&gt;

&lt;ul&gt;
&lt;li&gt;Fabric VS Puppet&lt;/li&gt;
&lt;/ul&gt;

&lt;p&gt;&#x8FD9;&#x662F;&#x4E24;&#x79CD;&#x81EA;&#x52A8;&#x5316;&#x5DE5;&#x5177;&#x7684;&#x601D;&#x8DEF;&#xFF1A;&#x8FC7;&#x7A0B;&#x578B;&#x548C;&#x72B6;&#x6001;&#x578B;&#x3002;&#x4EE5;Fabric&#xFF0C;Capistrao&#x7B49;&#x5DE5;&#x5177;&#x4E3A;&#x4EE3;&#x8868;&#x7684;&#x8FC7;&#x7A0B;&#x578B;&#x5DE5;&#x5177;&#xFF0C;&#x57FA;&#x4E8E;SSH&#xFF0C;&#x5C06;&#x8F6F;&#x4EF6;&#x90E8;&#x7F72;&#x7684;&#x6B65;&#x9AA4;&#x5B9A;&#x4E49;&#x4E3A;&#x4EFB;&#x52A1;&#x3002;&#x901A;&#x8FC7;&#x5B8C;&#x6210;&#x4E00;&#x6B65;&#x6B65;&#x4EFB;&#x52A1;&#xFF0C;&#x5B8C;&#x6210;&#x7F16;&#x8BD1;&#xFF0C;&#x6253;&#x5305;&#xFF0C;&#x5206;&#x53D1;&#xFF0C;&#x5B89;&#x88C5;&#x8FD9;&#x4E9B;&#x6B65;&#x9AA4;&#x3002;&#x4E5F;&#x6709;&#x4EE5;MCollective&#x8FD9;&#x6837;&#x7684;&#x57FA;&#x4E8E;&#x6D88;&#x606F;&#x961F;&#x5217;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x5F02;&#x6B65;&#x5B9E;&#x65F6;&#x5E76;&#x53D1;&#xFF0C;&#x4F46;&#x9700;&#x8981;&#x5B89;&#x88C5;&#x76F8;&#x5E94;&#x5BA2;&#x6237;&#x7AEF;&#x3002;&#x800C;&#x4EE5;Puppet&#xFF0C;Chef&#x7B49;&#x8FD9;&#x4E9B;&#x4E3A;&#x4EE3;&#x8868;&#x7684;&#x72B6;&#x6001;&#x578B;&#x5DE5;&#x5177;&#xFF0C;&#x5B9A;&#x4E49;&#x673A;&#x5668;&#x7684;&#x72B6;&#x6001;&#xFF1A;&#x6BD4;&#x5982;&#x9700;&#x8981;&#x5B89;&#x88C5;&#x4EC0;&#x4E48;&#x7248;&#x672C;&#x7684;&#x8F6F;&#x4EF6;&#x5305;&#xFF0C;&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x7528;&#x6237;&#xFF0C;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x7684;&#x5185;&#x5BB9;&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x7136;&#x540E;&#x8BA9;&#x673A;&#x5668;&#x8FBE;&#x5230;&#x9884;&#x5B9A;&#x4E49;&#x7684;&#x72B6;&#x6001;&#x3002;&#x5B83;&#x4EEC;&#x5C06;&#x8F6F;&#x4EF6;&#x5305;&#x3001;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x8FD9;&#x4E9B;&#x62BD;&#x8C61;&#x4E3A;&#x8D44;&#x6E90;&#x3002;&#x5B9A;&#x4E49;&#x8BE5;&#x89D2;&#x8272;&#x673A;&#x5668;&#x9700;&#x8981;&#x5B89;&#x88C5;&#x7684;&#x8F6F;&#x4EF6;&#x5305;&#xFF0C;&#x6BCF;&#x6B21;&#x66F4;&#x65B0;&#x6307;&#x5B9A;&#x65B0;&#x7684;&#x7248;&#x672C;&#x53F7;&#x7136;&#x540E;&#x673A;&#x5668;&#x5C31;&#x4F1A;&#x66F4;&#x65B0;&#x81F3;&#x65B0;&#x7248;&#x672C;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x5982;&#x679C;&#x80FD;&#x6709;&#x673A;&#x5668;&#x7684;&#x72B6;&#x6001;&#x7BA1;&#x7406;&#xFF0C;&#x90A3;&#x5C31;&#x4E0D;&#x5B58;&#x5728;&#x6240;&#x8C13;&#x7684;&#x6062;&#x590D;&#x73AF;&#x5883;&#x7684;&#x8BF4;&#x6CD5;&#x3002;&#x53EA;&#x662F;&#x673A;&#x5668;&#x6709;&#x6CA1;&#x6709;&#x8FBE;&#x5230;&#x9884;&#x5B9A;&#x4E49;&#x7684;&#x72B6;&#x6001;&#x800C;&#x5DF2;&#x3002;&#x65B0;&#x5174;&#x7684;SaltStack/Ansible&#x5747;&#x6709;&#x4E0A;&#x8FF0;&#x4E24;&#x79CD;&#x601D;&#x8DEF;&#x3002;&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x90E8;&#x7F72;&#x65B0;&#x6280;&#x672F;&lt;/p&gt;

&lt;ul&gt;
&lt;li&gt;Image/Vagrant&lt;/li&gt;
&lt;/ul&gt;

&lt;p&gt;&#x5BF9;&#x4E8E;&#x5F88;&#x591A;&#x901A;&#x7528;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x5C24;&#x5176;&#x662F;IAAS&#x5E73;&#x53F0;&#xFF0C;&#x53EF;&#x4EE5;&#x5236;&#x4F5C;&#x57FA;&#x7840;&#x7684;&#x955C;&#x50CF;&#xFF0C;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x57FA;&#x7840;&#x73AF;&#x5883;&#x7684;&#x7EDF;&#x4E00;&#x6807;&#x51C6;&#x5316;&#x914D;&#x7F6E;&#xFF0C;&#x6839;&#x636E;&#x9700;&#x6C42;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x7C7B;&#x578B;&#x7684;&#x96C6;&#x7FA4;&#x53EF;&#x4EE5;&#x57FA;&#x4E8E;&#x57FA;&#x7840;&#x955C;&#x50CF;&#x7EE7;&#x627F;&#x5404;&#x81EA;&#x7684;&#x57FA;&#x7840;&#x955C;&#x50CF;&#x3002;&#x53EA;&#x9700;&#x8981;&#x5B9A;&#x5236;&#x76F8;&#x5E94;&#x7C7B;&#x578B;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x8F6F;&#x4EF6;&#x5DF2;&#x7ECF;&#x5B89;&#x88C5;&#xFF0C;&#x5728;&#x6B64;&#x4E4B;&#x4E0A;&#x8F85;&#x4EE5;&#x4E4B;&#x524D;&#x7684;&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#xFF0C;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5B9E;&#x73B0;&#x6A21;&#x5757;&#x90E8;&#x7F72;&#x3002;Vagrant&#x662F;&#x4E00;&#x6B3E;&#x955C;&#x50CF;&#x7BA1;&#x7406;&#x8F6F;&#x4EF6;&#xFF0C;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;build&#x673A;&#x5668;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x7B80;&#x5355;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x5E76;&#x4E14;&#x63D0;&#x4F9B;&#x6574;&#x5957;&#x5B8C;&#x6574;&#x7684;&#x6D41;&#x7A0B;&#x7BA1;&#x7406;&#x3002;
+ Container/Docker&lt;/p&gt;

&lt;p&gt;&#x865A;&#x62DF;&#x673A;&#x9694;&#x79BB;&#x6027;&#x548C;&#x8D44;&#x6E90;&#x4F7F;&#x7528;&#x7387;&#x8FD8;&#x6709;&#x5F85;&#x63D0;&#x9AD8;&#xFF0C;&#x800C;&#x4E14;&#x4F7F;&#x7528;&#x8D77;&#x6765;&#x663E;&#x5F97;&#x592A;&#x91CD;&#x3002;&#x6240;&#x4EE5;Container&#x7684;&#x6280;&#x672F;&#x8FC5;&#x901F;&#x53D1;&#x5C55;&#xFF0C;&#x8FD9;&#x79CD;&#x8F7B;&#x91CF;&#x7EA7;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7EA7;&#x522B;&#x7684;&#x865A;&#x62DF;&#x5316;&#x6280;&#x672F;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x865A;&#x62DF;&#x673A;&#x6280;&#x672F;&#x7684;&#x5F88;&#x597D;&#x8865;&#x5145;&#x3002;&#x542F;&#x52A8;&#x5B9E;&#x4F8B;&#x80FD;&#x5728;&#x79D2;&#x7EA7;&#x5B8C;&#x6210;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F8B;&#x5982;&#x540C;&#x673A;&#x5668;&#x7684;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E00;&#x6837;&#xFF0C;&#x5374;&#x80FD;&#x63D0;&#x4F9B;&#x5F88;&#x597D;&#x7684;&#x8D44;&#x6E90;&#x9694;&#x79BB;&#x548C;&#x9650;&#x5236;&#x3002;&#x53EF;&#x4EE5;&#x5C06;&#x6BCF;&#x7C7B;&#x6A21;&#x5757;&#x5236;&#x4F5C;&#x4E00;&#x4E2A;Container&#x955C;&#x50CF;&#xFF0C;&#x6BCF;&#x6B21;&#x7684;&#x66F4;&#x65B0;&#x5C31;&#x662F;&#x65B0;&#x542F;&#x52A8;&#x65B0;&#x5B9E;&#x4F8B;&#x3002;&#x771F;&#x6B63;&#x5B9E;&#x73B0;&#x4E00;&#x6B21;&#x90E8;&#x7F72;&#xFF0C;&#x968F;&#x5904;&#x53EF;&#x7528;&#x3002;&#x8FD9;&#x65B9;&#x9762;Docker(LXC+CGroup+NameSpace)&#x662F;&#x4EE3;&#x8868;&#xFF0C;&#x5E76;&#x4E14;&#x63D0;&#x4F9B;&#x7C7B;Git&#x7684;&#x6D41;&#x7A0B;&#x7BA1;&#x7406;&#x3002;&lt;/p&gt;

&lt;p&gt;docker &#x8FD9;&#x79CD;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7EA7;&#x865A;&#x62DF;&#x5316;&#x6280;&#x672F;&#x6781;&#x5927;&#x5730;&#x5F25;&#x8865;&#x4E86;&#x786C;&#x4EF6;&#x865A;&#x62DF;&#x5316;&#x7684;&#x4E0D;&#x8DB3;&#x5E76;&#x4E14;&#x6EE1;&#x8DB3;&#x4E86;&#x5BF9;&#x8D44;&#x6E90;&#x9694;&#x79BB;&#x7684;&#x9700;&#x6C42;&#x3002;&#x542F;&#x52A8;&#x5B9E;&#x4F8B;&#x5982;&#x540C;&#x542F;&#x52A8;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E00;&#x6837;&#x5FEB;&#x901F;&#x3002;&#x5BF9;&#x4E8E;&#x5927;&#x6279;&#x91CF;&#x90E8;&#x7F72;&#x80FD;&#x591F;&#x5F88;&#x597D;&#x5730;&#x4FDD;&#x8BC1;&#x4E00;&#x81F4;&#x6027;&#x3002;&#x662F;&#x672A;&#x6765;&#x90E8;&#x7F72;&#x7684;&#x65B0;&#x65B9;&#x5411;&#x3002;&#x57FA;&#x4E8E;Docker&#x90E8;&#x7F72;&#x4E4B;&#x4E0A;&#x8FD8;&#x6709;&#x65B0;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x503C;&#x5F97;&#x5173;&#x6CE8;&#x7684;&#x662F;CoreOS&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x5B83;&#x751F;&#x6765;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x5927;&#x89C4;&#x6A21;&#x90E8;&#x7F72;&#x3002;Docker&#x4E5F;&#x53EF;&#x4EE5;&#x548C;OpenStack&#x8FD9;&#x6837;&#x7684;&#x5DE5;&#x5177;&#x7ED3;&#x5408;&#xFF0C;&#x4F5C;&#x4E3A;OpenStack&#x7684;Hypervisor(&#x5E94;&#x8BE5;&#x662F;container), &#x8FD9;&#x6837;&#x901A;&#x8FC7;&#x7BA1;&#x7406;OpenStack&#x5C31;&#x53EF;&#x5B9E;&#x73B0;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x96C6;&#x7FA4;&#x7BA1;&#x7406;&#x3002;&lt;/p&gt;&lt;/li&gt;
&lt;/ul&gt;

&lt;p&gt;&#x8FD9;&#x4E9B;&#x5E38;&#x89C1;&#x65B9;&#x5F0F;&#x4E5F;&#x53CD;&#x5E94;&#x4E86;&#x90E8;&#x7F72;&#x624B;&#x6BB5;&#x53D8;&#x5316;&#x7684;&#x8F68;&#x8FF9;&#xFF0C;&#x4ECE;&#x6700;&#x521D;&#x7684;&#x811A;&#x672C;&#x6807;&#x51C6;&#x5316;(CO&#x4EE3;&#x7801;&#x6216;&#x8005;&#x6253;&#x5305;&#x5B89;&#x88C5;)&#xFF0C;&#x5F15;&#x5165;&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#x505A;&#x5230;&#x72B6;&#x6001;&#x7BA1;&#x7406;&#xFF0C;&#x5230;Immutable Infrastructure&#x6280;&#x672F;&#x7684;&#x53D1;&#x5C55;&#x3002;&#x662F;&#x91C7;&#x7528;PASS&#x8FD8;&#x662F;IAAS&#xFF0C;&#x6CA1;&#x6709;&#x7EDF;&#x4E00;&#x7684;&#x7B54;&#x6848;&#xFF0C;&#x9002;&#x5408;&#x7684;&#x624D;&#x662F;&#x6700;&#x597D;&#x7684;&#x3002; Immutable Deployment&#x7684;&#x601D;&#x8DEF;&#x5176;&#x5B9E;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x5F53;&#x9700;&#x8981;&#x5347;&#x7EA7;&#x8F6F;&#x4EF6;&#x65F6;&#xFF0C;&#x90A3;&#x4E48;&#x5F88;&#x597D;Build&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5347;&#x7EA7;&#x540E;&#x7248;&#x672C;&#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x9700;&#x8981;&#x65B0;&#x8F6F;&#x4EF6;&#x65F6;&#xFF0C;&#x540C;&#x6837;Build&#x65B0;&#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5728;&#x4E4B;&#x524D;&#x7684;&#x5B9E;&#x4F8B;&#x4E0A;&#x5347;&#x7EA7;&#x548C;&#x5B89;&#x88C5;&#x3002;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x5F97;&#x76CA;&#x4E8E;Vagrant/Docker&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x7684;&#x6210;&#x719F;&#x3002;&lt;/p&gt;

&lt;hr&gt;

&lt;h3 id="toc_2"&gt;&#x7406;&#x60F3;&#x7684;&#x90E8;&#x7F72;&#x5E94;&#x8BE5;&#x6709;&#x4EC0;&#x4E48;&#x7279;&#x70B9;&lt;/h3&gt;

&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&#x90E8;&#x7F72;&#x662F;&#x591A;&#x9636;&#x6BB5;&#x7684;&#x6D41;&#x6C34;&#x7EBF;&#x7684;&lt;/p&gt;

&lt;p&gt;&#x90E8;&#x7F72;&#x662F;&#x4E2A;&#x534F;&#x4F5C;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5F00;&#x53D1;&#x6D4B;&#x8BD5;&#x8FD0;&#x7EF4;&#x76F8;&#x4E92;&#x5408;&#x4F5C;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x8F6F;&#x4EF6;&#x4EA7;&#x54C1;&#x4ECE;&#x5B8C;&#x6210;&#x5F00;&#x53D1;&#x4E4B;&#x540E;&#x8FDB;&#x5165;&#x4EA4;&#x4ED8;&#x9636;&#x6BB5;&#xFF1A;&#x6784;&#x5EFA;&#xFF0D;&#x7F16;&#x8BD1;&#xFF0D;&#x6253;&#x5305;&#xFF0D;&#x6D4B;&#x8BD5;&#xFF0D;&#x5206;&#x53D1;&#xFF0D;&#x4E0A;&#x7EBF;&#xFF0C;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x5C31;&#x50CF;&#x8BA1;&#x7B97;&#x673A;&#x6307;&#x4EE4;&#xFF1A;&#x53D6;&#x6307;&#xFF0D;&#x8BD1;&#x7801;&#xFF0D;&#x6267;&#x884C;&#x4E00;&#x6837;&#x662F;&#x6D41;&#x6C34;&#x7EBF;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x6D41;&#x6C34;&#x7EBF;&#x6D89;&#x53CA;&#x591A;&#x4E2A;&#x9636;&#x6BB5;&#xFF0C;&#x4EE3;&#x7801;&#x7ECF;&#x5386;Dev, Stage, Production&#x591A;&#x4E2A;&#x9636;&#x6BB5;&#x6700;&#x7EC8;&#x5728;&#x7EBF;&#x4E0A;&#x90E8;&#x7F72;&#x3002;&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x90E8;&#x7F72;&#x662F;&#x81EA;&#x52A8;&#x5316;&#x7684;&#x5FEB;&#x901F;&#x5316;&#x7684;&lt;/p&gt;

&lt;p&gt;&#x5C06;&#x90E8;&#x7F72;&#x5206;&#x9636;&#x6BB5;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x81EA;&#x52A8;&#x5316;&#x3001;&#x8FC7;&#x7A0B;&#x5316;&#xFF0C;&#x5F53;&#x5B9A;&#x4E49;&#x597D;&#x8FC7;&#x7A0B;&#x95F4;&#x7684;&#x63A5;&#x53E3;&#x540E;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4E13;&#x6CE8;&#x5728;&#x6BCF;&#x4E2A;&#x8FC7;&#x7A0B;&#x672C;&#x8EAB;&#xFF0C;&#x4ECE;&#x800C;&#x5F88;&#x597D;&#x5B9E;&#x73B0;&#x81EA;&#x52A8;&#x5316;&#x3002;&#x800C;&#x5FEB;&#x901F;&#x5316;&#x7684;&#x5B9E;&#x73B0;&#x53D6;&#x51B3;&#x4E8E;&#x5C06;&#x6BCF;&#x4E2A;&#x9636;&#x6BB5;&#x7684;&#x8017;&#x65F6;&#x7F29;&#x5230;&#x6700;&#x77ED;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6CD5;&#x5404;&#x9636;&#x6BB5;&#x653B;&#x7834;&#xFF0C;&#x6BD4;&#x5982;&#x5F88;&#x5BB9;&#x6613;&#x53D1;&#x73B0;&#x5206;&#x53D1;&#x8FD9;&#x6B65;&#x5176;&#x5B9E;&#x662F;&#x5F88;&#x8017;&#x65F6;&#x95F4;&#x7684;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5F53;&#x89C4;&#x6A21;&#x53D8;&#x5927;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90A3;&#x662F;&#x4E0D;&#x662F;&#x5C31;&#x5E94;&#x8BE5;&#x8003;&#x8651;&#x63D0;&#x9AD8;&#x81EA;&#x5DF1;&#x7684;&#x5206;&#x53D1;&#x80FD;&#x529B;&#x6216;&#x8005;&#x91C7;&#x7528;Yum&#x8FD9;&#x7C7B;&#x5305;&#x7BA1;&#x7406;&#xFF0B;CDN&#x52A0;&#x901F;&#x8FD9;&#x6837;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x5206;&#x53D1;&#x4E4B;&#x5916;Packaging&#x7684;&#x8FC7;&#x7A0B;&#x4E5F;&#x662F;&#x5F88;&#x8017;&#x65F6;&#x7684;&#x3002;&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x90E8;&#x7F72;&#x6D41;&#x6C34;&#x7EBF;&#x662F;&#x5E76;&#x884C;&#x7684;&lt;/p&gt;

&lt;p&gt;&#x5C31;&#x50CF;&#x8D85;&#x6807;&#x91CF;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x51FA;&#x73B0;&#x5141;&#x8BB8;&#x6307;&#x4EE4;&#x7684;&#x5E76;&#x884C;&#x6267;&#x884C;&#x4E00;&#x6837;&#xFF0C;&#x90E8;&#x7F72;&#x4E5F;&#x662F;&#x5141;&#x8BB8;&#x5E76;&#x884C;&#x7684;&#x3002;&#x8FD9;&#x4F53;&#x73B0;&#x5728;&#x4E24;&#x4E2A;&#x65B9;&#x9762;&#xFF1A;&lt;/p&gt;&lt;/li&gt;
&lt;/ul&gt;

&lt;pre&gt;&lt;code&gt;1. &#x6D41;&#x6C34;&#x7EBF;&#x95F4;&#x7684;&#x5E76;&#x884C;&#xFF0C;&#x5F53;&#x6D41;&#x6C34;&#x7EBF;&#x5904;&#x4E8E;&#x5206;&#x9636;&#x6BB5;&#x72B6;&#x6001;&#xFF0C;&#x591A;&#x4E2A;&#x6A21;&#x5757;&#x53EF;&#x4EE5;&#x5904;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x9636;&#x6BB5;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x591A;&#x6A21;&#x5757;&#x7684;&#x5E76;&#x884C;&#x4E0A;&#x7EBF;
2. &#x6D41;&#x6C34;&#x7EBF;&#x5185;&#x7684;&#x5E76;&#x884C;&#xFF0C;&#x6BD4;&#x5982;&#x6D4B;&#x8BD5;&#xFF1A;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x529F;&#x80FD;&#x6D4B;&#x8BD5;&#x8FD9;&#x4E9B;&#x7684;&#x5E76;&#x884C;&#xFF0C;&#x6D4B;&#x8BD5;&#x548C;&#x5206;&#x53D1;&#x7684;&#x5E76;&#x884C;
&lt;/code&gt;&lt;/pre&gt;

&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&#x90E8;&#x7F72;&#x662F;&#x968F;&#x65F6;&#x53EF;&#x8FDB;&#x884C;&#x7684;&lt;/p&gt;

&lt;p&gt;&#x4F20;&#x7EDF;&#x4EA4;&#x4ED8;&#x7684;&#x4E00;&#x4E2A;&#x5F88;&#x5927;&#x9650;&#x5236;&#x5C31;&#x662F;&#x5F80;&#x5F80;&#x4F1A;&#x9650;&#x5236;&#x53D8;&#x66F4;&#x6B21;&#x6570;&#xFF0C;&#x56FA;&#x7136;&#x4ECE;&#x8FD0;&#x7EF4;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x8BF4;&#x80FD;&#x51CF;&#x5C11;&#x53D8;&#x66F4;&#x6B21;&#x6570;&#x662F;&#x6700;&#x597D;&#xFF0C;&#x4F46;&#x662F;&#x53D8;&#x66F4;&#x6B21;&#x6570;&#x7684;&#x51CF;&#x5C11;&#x4E5F;&#x5B58;&#x5728;&#x4E00;&#x6B21;&#x53D8;&#x66F4;&#x5185;&#x5BB9;&#x7684;&#x589E;&#x52A0;&#xFF0C;&#x5176;&#x5B9E;&#x98CE;&#x9669;&#x4E5F;&#x662F;&#x589E;&#x52A0;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x654F;&#x6377;&#x548C;&#x7A33;&#x5B9A;&#x4E4B;&#x95F4;&#x9700;&#x8981;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x5E73;&#x8861;&#xFF0C;&#x51E1;&#x662F;&#x51C6;&#x5907;&#x597D;&#x7684;&#x53D8;&#x66F4;&#x5C31;&#x5E94;&#x8BE5;&#x968F;&#x65F6;&#x8FDB;&#x884C;&#xFF0C;&#x5FEB;&#x901F;&#x9A8C;&#x8BC1;&#xFF0C;&#x63D0;&#x9AD8;&#x4EA4;&#x4ED8;&#x901F;&#x5EA6;&#x548C;&#x9891;&#x7387;&#x4E5F;&#x53EF;&#x4EE5;&#x964D;&#x4F4E;&#x4EA4;&#x4ED8;&#x98CE;&#x9669;&#x3002;&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x90E8;&#x7F72;&#x662F;&#x5E42;&#x7B49;&#x7684;&#x53EF;&#x91CD;&#x590D;&#x7684;&lt;/p&gt;

&lt;p&gt;&#x5C31;&#x50CF;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4E2D;&#x5E42;&#x7B49;&#x7684;&#x63A5;&#x53E3;&#x4E00;&#x6837;&#xFF0C;&#x8FD0;&#x7EF4;&#x64CD;&#x4F5C;&#x4E5F;&#x9700;&#x8981;&#x5E42;&#x7B49;&#x8003;&#x8651;&#xFF0C;&#x5728;&#x53D8;&#x66F4;&#x524D;&#x4F1A;&#x5148;&#x68C0;&#x67E5;&#x53D8;&#x66F4;&#x662F;&#x5426;&#x5DF2;&#x5B58;&#x5728;&#xFF0C;&#x6BD4;&#x5982;&#x5982;&#x679C;&#x5DF2;&#x7ECF;&#x66F4;&#x65B0;&#x81F3;&#x65B0;&#x7248;&#x672C;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x5B89;&#x88C5;&#x65B0;&#x7248;&#x672C;&#x3002;&#x8FD9;&#x901A;&#x5E38;&#x662F;&#x501F;&#x52A9;Puppet/Chef&#x8FD9;&#x6837;&#x7684;&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#xFF0C;&#x5F53;&#x7136;&#x8FC7;&#x7A0B;&#x578B;&#x5DE5;&#x5177;&#x548C;Shell&#x811A;&#x672C;&#x4E5F;&#x80FD;&#x8FD9;&#x6837;&#x505A;&#xFF0C;&#x5C31;&#x662F;&#x9700;&#x8981;&#x63D0;&#x524D;&#x505A;&#x66F4;&#x591A;&#x68C0;&#x67E5;&#xFF0C;&#x4F46;&#x8FD9;&#x786E;&#x5B9E;&#x4E0D;&#x662F;&#x4E00;&#x79CD;&#x597D;&#x7684;&#x601D;&#x8DEF;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x786E;&#x5B9A;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5C31;&#x4F1A;&#x5FD8;&#x8BB0;&#xFF0C;&#x800C;&#x811A;&#x672C;&#x672C;&#x8EAB;&#x7684;&#x7EF4;&#x62A4;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x53C8;&#x662F;&#x4E00;&#x5806;&#x811A;&#x672C;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x4E3A;&#x4EC0;&#x4E48;&#x63D0;&#x5021;&#x8981;&#x4F7F;&#x7528;&#x72B6;&#x6001;&#x578B;&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#xFF0C;&#x4E00;&#x4E2A;&#x5F88;&#x7B80;&#x5355;&#x7684;&#x539F;&#x56E0;&#x5C31;&#x662F;&#x7EBF;&#x4E0A;&#x7ECF;&#x5E38;&#x6709;&#x673A;&#x5668;&#x53D1;&#x73B0;&#x67D0;&#x8F6F;&#x4EF6;&#x5305;&#x6CA1;&#x88C5;&#xFF0C;&#x7248;&#x672C;&#x4E0D;&#x5BF9;&#x7B49;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x90A3;&#x4E9B;&#x5F88;&#x57FA;&#x7840;&#x7684;&#x8F6F;&#x4EF6;&#x5305;&#x3002;&#x8FD9;&#x4E9B;&#x57FA;&#x7840;&#x4F9D;&#x8D56;&#x7684;&#x91CD;&#x8981;&#x6027;&#x4E5F;&#x662F;&#x4E0D;&#x8A00;&#x800C;&#x55BB;&#x7684;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x7CFB;&#x7EDF;&#x662F;&#x6536;&#x655B;&#x7684;&#x3002;&lt;/p&gt;&lt;/li&gt;
&lt;/ul&gt;

&lt;hr&gt;

&lt;h3 id="toc_3"&gt;&#x5F00;&#x6E90;CD&#x5DE5;&#x5177;GO&lt;/h3&gt;

&lt;ul&gt;
&lt;li&gt;&lt;p&gt;Thoughtworks&#x5F00;&#x6E90;&#x5DE5;&#x5177;&lt;a href="http://www.thoughtworks.com/products/go-continuous-delivery"&gt;Go&lt;/a&gt;&lt;/p&gt;

&lt;p&gt;&#x4EE5;&#x5178;&#x578B;&#x7684;&lt;a href="http://www.thoughtworks.com/products/docs/go/current/help/managing_pipelines.html"&gt;&#x4EA4;&#x4ED8;&#x6D41;&#x7A0B;&lt;/a&gt;&#x4E3A;&#x4F8B;&#xFF1A;Complie- Package - Test -  Deliver -Test  Environment - Production Environment&lt;/p&gt;

&lt;p&gt;Pipeline - Stage - Job(Unit Test/Function Test &#x5E76;&#x884C;) - Task &#x6811;&#x5F62;&#x7ED3;&#x6784;
&lt;img src="/Users/apple/Documents/document/go-tree.png" alt="&#x6811;&#x5F62;&#x7ED3;&#x6784;"&gt;&lt;/p&gt;

&lt;p&gt;&#x6BCF;&#x4E00;&#x6B21;&#x7684;&#x53D1;&#x5E03;&#x5C31;&#x662F;&#x4E00;&#x4E2A;Pipeline, &#x8FD9;&#x4E2A;Pipeline&#x6709;&#x591A;&#x4E2A;&#x9636;&#x6BB5;(&#x7F16;&#x8BD1;&#xFF0C;&#x6253;&#x5305;&#xFF0C;&#x6D4B;&#x8BD5;&#xFF0C;&#x9884;&#x53D1;&#x5E03;&#xFF0C;&#x53D1;&#x5E03;)&#xFF0C;&#x6BCF;&#x4E2A;&#x9636;&#x6BB5;&#x53C8;&#x5206;&#x591A;&#x4E2A;&#x5DE5;&#x4F5C;(&#x6BD4;&#x5982;&#x6D4B;&#x8BD5;&#xFF1A;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#xFF0C;&#x529F;&#x80FD;&#x6D4B;&#x8BD5;&#xFF0C;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x7B49;&#xFF0C;&#x8FD9;&#x4E9B;Job&#x6709;&#x4E9B;&#x53C8;&#x662F;&#x53EF;&#x4EE5;&#x5E76;&#x884C;&#x7684;&#xFF0C;&#x6BCF;&#x4E2A;Job&#x8DD1;&#x5728;&#x72EC;&#x7ACB;&#x7684;Agent&#x4E0A;)&#xFF0C;&#x6BCF;&#x4E2A;Job&#x53C8;&#x7EC6;&#x5206;&#x4E3A;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;(&#x6BD4;&#x5982;&#x529F;&#x80FD;&#x6D4B;&#x8BD5;&#x9700;&#x8981;&#x6D4B;&#x8BD5;&#x4E00;&#x4E2A;&#x4E2A;&#x7684;&#x6D4B;&#x8BD5;&#x7528;&#x4F8B;&#xFF0C;&#x6BCF;&#x4E00;&#x9879;&#x6D4B;&#x8BD5;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x5F53;&#x7136;&#x4EFB;&#x52A1;&#x95F4;&#x5982;&#x65E0;&#x4F9D;&#x8D56;&#x53EF;&#x4EE5;&#x5E76;&#x884C;)&lt;/p&gt;

&lt;p&gt;Go&#x662F;&#x4E00;&#x4E2A;C/S&#x67B6;&#x6784;&#x7684;CD&#x5DE5;&#x5177;&#xFF0C;Server&#x8D1F;&#x8D23;&#x5B89;&#x6392;&#x6BCF;&#x4E2A;Job&#x5728;&#x5177;&#x4F53;&#x7684;Agent&#x4E0A;&#x6267;&#x884C;&#x3002;&#x8FD9;&#x91CC;&#x7684;Agent&#x6709;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#xFF0C;&#x6709;&#x7684;&#x7528;&#x4E8E;&#x7F16;&#x8BD1;&#xFF0C;&#x6709;&#x7684;&#x7528;&#x4E8E;&#x6253;&#x5305;&#xFF0C;&#x6709;&#x7684;&#x7528;&#x4E8E;&#x6D4B;&#x8BD5;&#xFF0C;&#x529F;&#x80FD;&#x4E0D;&#x4E00;&#x800C;&#x8DB3;&#xFF0C;&#x73AF;&#x5883;&#x4E5F;&#x4E0D;&#x5C3D;&#x76F8;&#x540C;&lt;/p&gt;

&lt;p&gt;Go&#x5DE5;&#x5177;&#x76EE;&#x524D;&#x7684;&#x95EE;&#x9898;&#x95EE;&#x9898;&#xFF0C;&#x4E5F;&#x5728;&#x4E8E;&#x5BF9;Agent&#x7684;&#x7BA1;&#x7406;&#x4E0A;&#xFF0C;Agent&#x5C5E;&#x4E8E;IAAS&#x5C42;&#x9762;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x6253;&#x5305;&#xFF0C;&#x9700;&#x8981;Rhel5&#x548C;Rhel6&#x4E0D;&#x540C;&#x7CFB;&#x7EDF;&#x673A;&#x5668;&#xFF0C;&#x6D4B;&#x8BD5;&#x4E0D;&#x540C;&#x6A21;&#x5757;&#x4E0D;&#x540C;&#x4EA7;&#x54C1;&#x5BF9;&#x8FD0;&#x884C;&#x6761;&#x4EF6;&#x8981;&#x6C42;&#x4E5F;&#x4E0D;&#x4E00;&#x6837;&#x3002;&#x800C;&#x8FD9;&#x4E9B;Agent&#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;&#xFF0C;&#x9664;&#x4E86;&#x4F20;&#x7EDF;&#x865A;&#x62DF;&#x5316;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;Contianer&#x662F;&#x5F88;&#x597D;&#x7684;&#x9009;&#x62E9;&#x3002;&#x6700;&#x663E;&#x800C;&#x6613;&#x89C1;&#x7684;&#x5C31;&#x662F;&#x8FD9;&#x4E9B;&#x73AF;&#x5883;&#x53EF;&#x4EE5;&#x6279;&#x91CF;&#x5FEB;&#x901F;&#x6784;&#x5EFA;&#x3002;&#x5728;&#x4E0D;&#x7528;&#x7684;&#x65F6;&#x5019;&#x968F;&#x65F6;&#x53EF;&#x4EE5;&#x9500;&#x6BC1;&#x800C;&#x4E0D;&#x50CF;&#x865A;&#x673A;&#x4E00;&#x6837;&#x592A;&#x7B28;&#x91CD;&#x3002;&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x8FD9;&#x91CC;&#x9762;&#x6D89;&#x53CA;&#x4E09;&#x4E2A;&#x7BA1;&#x7406;&#xFF1A;&lt;/p&gt;

&lt;ul&gt;
&lt;li&gt;&#x6D41;&#x7A0B;&#x7BA1;&#x7406; &#x6B63;&#x5982;&#x524D;&#x9762;&#x6240;&#x63CF;&#x8FF0;&#x7684;&#x90A3;&#x6837;&lt;/li&gt;
&lt;li&gt;&#x4F9D;&#x8D56;&#x7BA1;&#x7406; &#x9636;&#x6BB5;&#x95F4;&#x7684;&#x4F9D;&#x8D56;&#xFF0C;&#x4EFB;&#x52A1;&#x95F4;&#x7684;&#x4F9D;&#x8D56;&lt;/li&gt;
&lt;li&gt;&#x7EDF;&#x8BA1;&#x56FE;&#x8868; &#x5404;&#x9636;&#x6BB5;&#x5404;&#x4EFB;&#x52A1;&#x8017;&#x65F6;&#x7EDF;&#x8BA1;&#x8FDB;&#x884C;&#x8FDB;&#x4E00;&#x6B65;&#x4F18;&#x5316;&#xFF0C;&#x6D4B;&#x8BD5;&#x5404;&#x9879;&#x6570;&#x636E;&#x7EDF;&#x8BA1;&#x7B49;&lt;/li&gt;
&lt;/ul&gt;&lt;/li&gt;
&lt;/ul&gt;
</description>
    </item>
    <item>
      <title>Sildes About Puppet And MCollective</title>
      <link>http://junqili.com/puppet/sildes-about-puppet-and-mcollective</link>
      <pubDate>2014-03-21</pubDate>
      <description>&lt;h2 id="toc_0"&gt;&#x5DE5;&#x5177;&#x57FA;&#x672C;&#x4ECB;&#x7ECD;&lt;/h2&gt;

&lt;hr&gt;

&lt;div&gt;
    &lt;ul&gt;
        &lt;p&gt;&#x8FD9;&#x4E24;&#x4E2A;Slides&#x4E3B;&#x8981;&#x4ECB;&#x7ECD;&#x4E86;Puppet&#x548C;MCollective&#x7684;&#x6982;&#x8C8C;&#xFF0C;&#x5165;&#x95E8;&#x7EA7;&#x4ECB;&#x7ECD;&#xFF0C;&#x53EF;&#x4EE5;&#x4E86;&#x89E3;&#x8FD9;&#x4E24;&#x4E2A;&#x5DE5;&#x5177;&#x7684;&#x80CC;&#x666F;&#xFF0C;&#x662F;&#x4EC0;&#x4E48;&#x4EE5;&#x53CA;&#x7279;&#x70B9;&#x548C;&#x4F7F;&#x7528;&#x7B49;&#x3002;&lt;/p&gt;
    &lt;/ul&gt;
    &lt;hr&gt;
    &lt;ul&gt;
        &lt;li&gt;&lt;a href="/assets/media/pdf/introduction-to-puppet.pdf"}}"&gt;&lt;img src="/assets/media/pdf/attach.png"&gt;Puppet&#x7B80;&#x4ECB;&lt;/a&gt;&lt;/li&gt;
        &lt;li&gt;&lt;a href="/assets/media/pdf/introduction-to-mcollective.pdf"}}"&gt;&lt;img src="/assets/media/pdf/attach.png"&gt;MCollective&#x7B80;&#x4ECB;&lt;/a&gt;&lt;/li&gt;
    &lt;/ul&gt;
&lt;/div&gt;
</description>
    </item>
    <item>
      <title>Troubleshooting 5minutes</title>
      <link>http://junqili.com/linux/troubleshooting-5minutes</link>
      <pubDate>2013-10-23</pubDate>
      <description>&lt;h2 id="toc_0"&gt;&#x6545;&#x969C;&#x6392;&#x9664;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x4E94;&#x5206;&#x949F;&lt;/h2&gt;

&lt;p&gt;&#x5728;&#x5904;&#x7406;&#x65E5;&#x5E38;&#x8FD0;&#x7EF4;&#x3001;&#x4F18;&#x5316;&#x548C;&#x6269;&#x5C55;&#x6027;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x5019;,&#x7ECF;&#x5E38;&#x78B0;&#x5230;&#x4E86;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x89C4;&#x6A21;&#x7684;&#x6027;&#x80FD;&#x5F88;&#x5DEE;&#x7684;&#x7CFB; &#x7EDF;&#x548C;&#x57FA;&#x7840;&#x8BBE;&#x65BD;(&#x901A;&#x5E38;&#x662F;&#x5927;&#x89C4;&#x6A21;&#x7684;,&#x6BD4;&#x5982; CNN &#x6216;&#x8005;&#x4E16;&#x754C;&#x94F6;&#x884C;&#x7684;&#x7CFB;&#x7EDF;)&#x3002;&#x518D;&#x52A0;&#x4E0A;&#x4FEE;&#x590D;&#x65F6;&#x95F4;&#x7D27;&#x8FEB;&#x3001; &#x5947;&#x8469;&#x7684;&#x6280;&#x672F;&#x5E73;&#x53F0;&#x3001;&#x7F3A;&#x5C11;&#x4FE1;&#x606F;&#x548C;&#x6587;&#x6863;,&#x57FA;&#x672C;&#x4E0A;&#x8FD9;&#x8FC7;&#x7A0B;&#x90FD;&#x4F1A;&#x60E8;&#x75DB;&#x5230;&#x8BA9;&#x6211;&#x4EEC;&#x7559;&#x4E0B;&#x6DF1;&#x523B;&#x7684;&#x8BB0;&#x5FC6;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x9020;&#x6210;&#x6545;&#x969C;&#x7684;&#x539F;&#x56E0;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x662F;&#x4E0D;&#x660E;&#x663E;&#x7684;:&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x4E9B;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x5F00;&#x59CB;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x3002;&lt;/p&gt;

&lt;hr&gt;

&lt;h4 id="toc_1"&gt;&#x83B7;&#x53D6;&#x4E0A;&#x4E0B;&#x6587;&#x4FE1;&#x606F;&lt;/h4&gt;

&lt;p&gt;&#x4E0D;&#x8981;&#x6025;&#x4E8E;&#x53BB;&#x670D;&#x52A1;&#x5668;&#x64CD;&#x4F5C;,&#x9700;&#x8981;&#x641E;&#x6E05;&#x695A;&#x5BF9;&#x670D;&#x52A1;&#x5668;&#x548C;&#x8FD9;&#x4E2A;&#x7279;&#x5B9A;&#x6545;&#x969C;&#x5230;&#x5E95;&#x4E86;&#x89E3;&#x591A;&#x5C11;&#x3002;&#x4F60;&#x4E0D;&#x5E0C;&#x671B; &#x6D6A;&#x8D39;&#x4F60;&#x7684;&#x65F6;&#x95F4;&#x5728;&#x9ED1;&#x6697;&#x4E2D;&#x6392;&#x9664;(&#x6545;&#x969C;)&#x3002;
&#x4E00;&#x4E9B;&#x201C;&#x5FC5;&#x987B;&#x4E86;&#x89E3;&#x201D;&#x7684;&#x95EE;&#x9898;:&lt;/p&gt;

&lt;ul&gt;
&lt;li&gt;&#x95EE;&#x9898;&#x7684;&#x786E;&#x5207;&#x8868;&#x73B0;&#x662F;&#x4EC0;&#x4E48;?&#x6CA1;&#x6709;&#x53CD;&#x5E94;?&#x51FA;&#x73B0;&#x9519;&#x8BEF;?&lt;/li&gt;
&lt;li&gt;&#x95EE;&#x9898;&#x4EC0;&#x4E48;&#x65F6;&#x95F4;&#x5F00;&#x59CB;&#x88AB;&#x6CE8;&#x610F;&#x5230;?&lt;/li&gt;
&lt;li&gt;&#x95EE;&#x9898;&#x662F;&#x5426;&#x53EF;&#x91CD;&#x73B0;?&lt;/li&gt;
&lt;li&gt;&#x6709;&#x65E0;&#x4EFB;&#x4F55;&#x89C4;&#x5F8B;(&#x6BD4;&#x5982;&#x6BCF;&#x5C0F;&#x65F6;&#x53D1;&#x751F;&#x4E00;&#x6B21;)?&lt;/li&gt;
&lt;li&gt;&#x5E73;&#x53F0;&#x6700;&#x8FD1;&#x4E00;&#x6B21;&#x6539;&#x53D8;&#x662F;&#x4EC0;&#x4E48;(code, servers, stack)?&lt;/li&gt;
&lt;li&gt;&#x95EE;&#x9898;&#x662F;&#x5426;&#x4F1A;&#x5F71;&#x54CD;&#x7279;&#x5B9A;&#x7528;&#x6237;&#x6BB5;(&#x767B;&#x5F55;,&#x767B;&#x51FA;,&#x5B9A;&#x4F4D;...)?&lt;/li&gt;
&lt;li&gt;&#x6709;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5173;&#x4E8E;&#x8FD9;&#x4E2A;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;(&#x7269;&#x7406;&#x6216;&#x903B;&#x8F91;)&#x7684;&#x76F8;&#x5173;&#x6587;&#x6863;?&lt;/li&gt;
&lt;li&gt;&#x662F;&#x5426;&#x6709;&#x76F8;&#x5173;&#x76D1;&#x63A7;&#x5E73;&#x53F0;?Munin,Zabbix,Nagios, New Relic...&#x6216;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x76D1;&#x63A7;&#x5E73;&#x53F0;&lt;/li&gt;
&lt;li&gt;&#x6709;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;(&#x96C6;&#x4E2D;&#x5316;)&#x65E5;&#x5FD7;?Loggly, Airbrake, Graylog...&lt;/li&gt;
&lt;/ul&gt;

&lt;p&gt;&#x6700;&#x540E;&#x4E24;&#x70B9;&#x662F;&#x6700;&#x4FBF;&#x5229;&#x7684;&#x4FE1;&#x606F;&#x6765;&#x6E90;,&#x4F46;&#x662F;&#x522B;&#x671F;&#x671B;&#x592A;&#x591A;:&#x5B83;&#x4EEC;&#x901A;&#x5E38;&#x4E5F;&#x662F;&#x90A3;&#x4E9B;&#x4F1A;&#x5931;&#x53BB;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x867D; &#x7136;&#x6CA1;&#x6709;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;,&#x4F46;&#x662F;&#x8981;&#x505A;&#x4E2A;&#x7EAA;&#x5F55;&#x5E76;&#x8BA9;&#x5176;&#x6062;&#x590D;&#x4E14;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#x3002;&lt;/p&gt;

&lt;p&gt;&lt;strong&gt;&#x8865;&#x5145;&#x8BF4;&#x660E;&lt;/strong&gt;:&lt;/p&gt;

&lt;pre&gt;&lt;code&gt;&#x5BF9;&#x4E8E;&#x76D1;&#x63A7;&#x5DE5;&#x5177; Zabbix,Nagios &#x5927;&#x5BB6;&#x53EF;&#x80FD;&#x6BD4;&#x8F83;&#x719F;&#x6089;,&#x7B80;&#x5355;&#x4ECB;&#x7ECD;&#x4E0B; Munin &#x548C; New Relic&#x3002;

+ Munin &#x662F;&#x4E00;&#x6B3E;&#x7F51;&#x7EDC;&#x5316;&#x8D44;&#x6E90;&#x76D1;&#x63A7;&#x5DE5;&#x5177;,&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x5206;&#x6790;&#x8D44;&#x6E90;&#x7684;&#x8D8B;&#x52BF;&#x548C;&#x521A;&#x521A;&#x53D1;&#x751F;&#x4E86;&#x4EC0;&#x4E48;&#x5BFC;&#x81F4;&#x6027;&#x80FD;&#x964D;&#x4F4E;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x3002;&#x5B83;&#x7684;&#x8BBE;&#x8BA1;&#x7279;&#x70B9;&#x662F;&#x5373;&#x63D2;&#x5373;&#x7528;,&#x6709;&#x53E5;&#x8BDD;&#x8FD9;&#x6837;&#x8BC4;&#x4EF7; Munin &#x56E0; Plugin &#x800C;&#x4EAE;&#x3002;&#x9ED8;&#x8BA4;&#x5B89;&#x88C5;&#x5DF2;&#x7ECF;&#x63D0;&#x4F9B;&#x4E86;&#x5927;&#x91CF;&#x753B;&#x56FE;&#x3002; Munin &#x662F;&#x4E00;&#x4E2A; server-nodes &#x7ED3;&#x6784;,&#x4E00;&#x4E2A; server &#x5BF9;&#x5E94;&#x591A;&#x53F0; node,&#x6BCF;&#x53F0; node &#x90FD;&#x662F;&#x88AB;&#x76D1;&#x63A7; &#x8282;&#x70B9;,server &#x662F;&#x7EDF;&#x8BA1; node &#x7684;&#x6570;&#x636E;&#x5E76;&#x8FDB;&#x884C;&#x7ED8;&#x56FE;&#x751F;&#x6210; html &#x7684;&#x8282;&#x70B9;&#x3002;

+ New Relic &#x662F;&#x4E00;&#x6B3E;&#x57FA;&#x4E8E; SaaS &#x7684;&#x4E91;&#x7AEF;&#x5E94;&#x7528;&#x76D1;&#x6D4B;&#x4E0E;&#x7BA1;&#x7406;&#x5E73;&#x53F0;, New Relic &#x63D0; &#x4F9B;&#x670D;&#x52A1;&#x5305;&#x62EC;&#x7EC8;&#x7AEF;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x76D1;&#x63A7;&#x3001;&#x5E94;&#x7528;&#x76D1;&#x63A7;&#x3001;&#x6570;&#x636E;&#x5E93;&#x76D1;&#x63A7;&#x3001;&#x57FA;&#x7840;&#x5E95;&#x5C42;&#x76D1;&#x63A7;&#x751A;&#x81F3; &#x5355;&#x4E2A;&#x5E73;&#x53F0;&#x7684;&#x76D1;&#x63A7;,&#x80FD;&#x4E3A;&#x5E94;&#x7528;&#x7684;&#x5065;&#x5EB7;&#x63D0;&#x4F9B;&#x5B9E;&#x65F6;&#x7684;&#x53EF;&#x9884;&#x89C1;&#x6027;&#x3002;&#x652F;&#x6301;&#x7528; Ruby&#x3001;PHP&#x3001; Java&#x3001;.NET &#x4EE5;&#x53CA; Python &#x7B49;&#x8BED;&#x8A00;&#x5199;&#x7684;&#x5E94;&#x7528;&#x4EE5;&#x53CA; Android &#x548C; IOS &#x5E73;&#x53F0;&#x79FB;&#x52A8; &#x5E94;&#x7528;&#x76D1;&#x63A7;&#x3002;

&#x4E09;&#x4E2A;&#x65E5;&#x5FD7;&#x5DE5;&#x5177;&#x7B80;&#x5355;&#x4ECB;&#x7ECD;&#x3002;

+ loggly &#x63D0;&#x4F9B;&#x65E5;&#x5FD7;&#x5373;&#x670D;&#x52A1;(logging as a service)&#x3002;&#x5B83;&#x652F;&#x6301;&#x65E5;&#x5FD7;&#x7BA1;&#x7406;&#x5E76;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x5F88;&#x5BB9;&#x6613;&#x68C0;&#x7D22;&#x548C;&#x5BFC;&#x822A;&#x65E5;&#x5FD7;&#x3002;&#x91C7;&#x7528; Syslog &#x548C;&#x63D0;&#x4F9B; REST API &#x8FDB;&#x884C;&#x65E5;&#x5FD7; &#x6536;&#x96C6;,loggly &#x5F88;&#x5BB9;&#x6613;&#x5B89;&#x88C5;&#x5E76;&#x4E14;&#x63D0;&#x4F9B;&#x5BF9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x5FC3;&#x5316;&#x89C6;&#x56FE;,&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4E0D;&#x9700; &#x8981; SSH &#x5230;&#x673A;&#x5668;&#x4E0A;&#x8FDB;&#x884C; Tail &#x65E5;&#x5FD7;&#x3002;loggly &#x4E5F;&#x63D0;&#x4F9B;&#x4F5C;&#x4E3A;&#x8861;&#x91CF;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6027;&#x80FD;&#x7684; &#x65E5;&#x5FD7;&#x5206;&#x6790;&#x3002;

+ Airbrake &#x63D0;&#x4F9B;&#x9519;&#x8BEF;&#x7BA1;&#x7406;&#x5373;&#x670D;&#x52A1;(error mangagement as a service), &#x6536;&#x96C6;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EA7;&#x751F;&#x7684;&#x9519;&#x8BEF;&#x5E76;&#x8FDB;&#x884C;&#x7ED3;&#x679C;&#x805A;&#x5408;&#x7528;&#x4EE5;&#x56DE;&#x987E;&#x3002;&#x4F7F;&#x7528; Airbrake, &#x53EF;&#x4EE5;&#x5B9E;&#x65F6;&#x67E5;&#x770B;&#x5E76;&#x8FFD;&#x8E2A;&#x9519;&#x8BEF;,&#x4ECE;&#x800C;&#x5FEB;&#x901F;&#x4FEE;&#x590D;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x907F;&#x514D;&#x4E86;&#x76F4;&#x63A5;&#x67E5; &#x770B;&#x65E5;&#x5FD7;&#x8FDB;&#x884C;&#x9519;&#x8BEF;&#x7BA1;&#x7406;&#x3002;&#x540C;&#x65F6;&#x5B83;&#x4E5F;&#x652F;&#x6301; REST API&#x3002;

+ Graylog &#x662F;&#x5F00;&#x6E90; syslog &#x5B9E;&#x73B0;&#x5E76;&#x5C06;&#x65E5;&#x5FD7;&#x5B58;&#x50A8;&#x5728; MongoDB &#x4E2D;,&#x5B83;&#x7531;&#x4E24;&#x90E8;&#x5206;&#x7EC4; &#x6210;:&#x91C7;&#x7528; java &#x7F16;&#x5199;&#x7684;&#x670D;&#x52A1;&#x7AEF;&#x901A;&#x8FC7; TCP &#x6216;&#x8005; UDP &#x63A5;&#x6536; syslog messages &#x5E76; &#x5B58;&#x50A8;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;;&#x91C7;&#x7528; ROR &#x5B9E;&#x73B0;&#x7684; WEB &#x754C;&#x9762;&#x5141;&#x8BB8;&#x4F60;&#x67E5;&#x770B;&#x65E5;&#x5FD7;&#x6D88;&#x606F;&#x3002;
&lt;/code&gt;&lt;/pre&gt;

&lt;hr&gt;

&lt;h4 id="toc_2"&gt;&#x6709;&#x54EA;&#x4E9B;&#x7528;&#x6237;&lt;/h4&gt;

&lt;pre&gt;&lt;code&gt;$ w
$ last
&lt;/code&gt;&lt;/pre&gt;

&lt;p&gt;&#x4E0D;&#x662F;&#x6700;&#x5173;&#x952E;&#x7684;,&#x4F46;&#x662F;&#x4F60;&#x6700;&#x597D;&#x522B;&#x5728;&#x4E00;&#x53F0;&#x5176;&#x4ED6;&#x4EBA;&#x6D4B;&#x8BD5;&#x7684;&#x673A;&#x5668;&#x4E0A;&#x8FDB;&#x884C;&#x6545;&#x969C;&#x6392;&#x9664;,&#x5C31;&#x50CF;&#x4E00;&#x4E2A; &#x4EBA;&#x5728;&#x53A8;&#x623F;&#x505A;&#x996D;&#x5C31;&#x8DB3;&#x591F;&#x4E86;&#x3002;&lt;/p&gt;

&lt;p&gt;&lt;strong&gt;&#x8865;&#x5145;&#x8BF4;&#x660E;&lt;/strong&gt;&lt;/p&gt;

&lt;pre&gt;&lt;code&gt;w &#x6267;&#x884C;&#x8FD9;&#x9879;&#x6307;&#x4EE4;&#x53EF;&#x5F97;&#x77E5;&#x76EE;&#x524D;&#x767B;&#x5165;&#x7CFB;&#x7EDF;&#x7684;&#x7528;&#x6237;&#x6709;&#x90A3;&#x4E9B;&#x4EBA;,&#x4EE5;&#x53CA;&#x4ED6;&#x4EEC;&#x6B63;&#x5728;&#x6267;&#x884C;&#x7684;&#x7A0B;&#x5E8F;&#x3002;&#x5355;&#x72EC;&#x6267;&#x884C; w &#x547D;&#x4EE4;&#x4F1A;&#x663E;&#x793A;&#x6240;&#x6709;&#x7684;&#x7528;&#x6237;,&#x60A8;&#x4E5F;&#x53EF;&#x6307;&#x5B9A;&#x7528;&#x6237;&#x540D;&#x79F0;,&#x4EC5;&#x663E;&#x793A;&#x67D0;&#x4F4D;&#x7528;&#x6237;&#x7684;&#x76F8;&#x5173;&#x4FE1;&#x606F;&#x3002;
&lt;/code&gt;&lt;/pre&gt;

&lt;p&gt;&lt;img src="/assets/media/linux/tu1.png" alt="w command"&gt;&lt;/p&gt;

&lt;pre&gt;&lt;code&gt;last&#x548C;lastb&#x90FD;&#x662F;&#x5217;&#x51FA;&#x76EE;&#x524D;&#x548C;&#x8FC7;&#x53BB;&#x767B;&#x5F55;&#x7684;&#x7528;&#x6237;&#x4FE1;&#x606F;,&#x8FD9;&#x4E24;&#x4E2A;&#x547D;&#x4EE4;&#x5BF9;&#x4E8E;&#x8FFD;&#x8E2A;&#x4E00;&#x822C;&#x8D26; &#x53F7;&#x8005;&#x7684;&#x4F7F;&#x7528;&#x884C;&#x4E3A;&#x5F88;&#x6709;&#x5E2E;&#x52A9;&#x3002;
+ last &#x67E5;&#x627E;&#x6587;&#x4EF6;/var/log/wtmp &#x5E76;&#x5217;&#x51FA;&#x81EA;&#x4ECE;&#x6587;&#x4EF6;&#x521B;&#x5EFA;&#x65F6;&#x767B;&#x5F55;&#x548C;&#x767B;&#x51FA;&#x7684;&#x7528;&#x6237;&#x5217; &#x8868;,&#x5217;&#x8868;&#x663E;&#x793A;&#x7528;&#x6237;&#x540D;&#x6216; tty &#x540D;&#x79F0;&#x3002;&#x6587;&#x4EF6;/var/log/wtmp &#x8BB0;&#x5F55;&#x6B63;&#x786E;&#x767B;&#x5F55;&#x7CFB;&#x7EDF; &#x8005;&#x7684;&#x7528;&#x6237;&#x4FE1;&#x606F;,&#x5305;&#x62EC;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x767B;&#x5F55;&#x3001;&#x6CE8;&#x9500;&#x53CA;&#x7CFB;&#x7EDF;&#x7684;&#x542F;&#x52A8;&#x3001;&#x505C;&#x673A;&#x7684;&#x65F6;&#x95F4;&#x3002;
+ lastb &#x547D;&#x4EE4;&#x4E0E; last &#x7C7B;&#x4F3C;,&#x53EA;&#x662F;&#x9ED8;&#x8BA4;&#x5B83;&#x663E;&#x793A;&#x7684;&#x6587;&#x4EF6;/var/log/btmp,&#x8BE5;&#x6587;&#x4EF6; &#x8BB0;&#x5F55;&#x9519;&#x8BEF;&#x767B;&#x5F55;&#x65F6;&#x6240;&#x4F7F;&#x7528;&#x8D26;&#x6237;&#x4FE1;&#x606F;&#x3002;&#x5FC5;&#x987B;&#x6307;&#x51FA;&#x65E0;&#x8BBA;&#x662F;&#x8BFB; btmp &#x8FD8;&#x662F; wtmp&#x3002;&#x90FD;&#x53EA; &#x662F;&#x9ED8;&#x8BA4;&#x884C;&#x4E3A;&#x3002;last(lastb)&#x53EF;&#x4EE5;&#x901A;&#x8FC7;-f &#x53C2;&#x6570;&#x6307;&#x5B9A;&#x6587;&#x4EF6;&#x3002;&#x6BD4;&#x5982; last -f var/log/btmp &#x884C;&#x4E3A;&#x4E0E; lastb &#x4E00;&#x6837;&#x3002;

&#x4E0E;&#x7528;&#x6237;&#x767B;&#x5F55;&#x76F8;&#x5173;&#x7684;&#x65E5;&#x5FD7;&#x6587;&#x4EF6;(&#x8FD9;&#x4E9B;&#x6587;&#x4EF6;&#x90FD;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A; last[lastb]&#x7684;&#x53C2;&#x6570;)
+ /var/log/btmp &#x2013; &#x8BB0;&#x5F55;&#x6240;&#x6709;&#x5931;&#x8D25;&#x767B;&#x5F55;&#x4FE1;&#x606F;
+ /var/log/lastlog &#x2014; &#x8BB0;&#x5F55;&#x6240;&#x6709;&#x7528;&#x6237;&#x7684;&#x6700;&#x8FD1;&#x4FE1;&#x606F;
+ /var/log/wtmp &#x6216;/var/log/utmp &#x2014; &#x5305;&#x542B;&#x767B;&#x5F55;&#x4FE1;&#x606F;&#x3002;&#x4F7F;&#x7528; wtmp &#x53EF;&#x4EE5;&#x627E;&#x51FA;&#x8C01;&#x6B63;&#x5728;&#x767B;&#x9646;&#x8FDB;&#x5165;&#x7CFB;&#x7EDF;,&#x8C01;&#x4F7F;&#x7528;&#x547D;&#x4EE4;&#x663E;&#x793A;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x6216;&#x4FE1;&#x606F;&#x7B49;&#x3002;
+ /var/log/faillog &#x2013; &#x5305;&#x542B;&#x7528;&#x6237;&#x767B;&#x5F55;&#x5931;&#x8D25;&#x4FE1;&#x606F;&#x3002;&#x6B64;&#x5916;,&#x9519;&#x8BEF;&#x767B;&#x5F55;&#x547D;&#x4EE4;&#x4E5F;&#x4F1A;&#x8BB0;&#x5F55;&#x5728;&#x672C;&#x6587;&#x4EF6;&#x4E2D;&#x3002;
&lt;/code&gt;&lt;/pre&gt;

&lt;hr&gt;

&lt;h4 id="toc_3"&gt;&#x521A;&#x521A;&#x6267;&#x884C;&#x4E86;&#x4EC0;&#x4E48;&lt;/h4&gt;

&lt;pre&gt;&lt;code&gt;$ history
&lt;/code&gt;&lt;/pre&gt;

&lt;p&gt;&#x67E5;&#x770B;&#x5386;&#x53F2;&#x901A;&#x5E38;&#x662F;&#x5F88;&#x597D;&#x7684;;&#x7ED3;&#x5408;&#x4E0A;&#x4E00;&#x6B65;&#x77E5;&#x9053;&#x7684;&#x54EA;&#x4E9B;&#x7528;&#x6237;&#x5728;&#x8FD9;&#x53F0;&#x673A;&#x5668;&#x7684;&#x4FE1;&#x606F;&#x3002; &#x7B80;&#x5355;&#x601D;&#x8003;&#x8FC7;&#x540E;,&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x60F3;&#x66F4;&#x65B0;&#x73AF;&#x5883;&#x53D8;&#x91CF; HISTTIMEFORMAT &#x6765;&#x8FFD;&#x8E2A;&#x8FD9;&#x4E9B;&#x547D;&#x4EE4;&#x6267;&#x884C;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x6BD4;&#x8C03;&#x67E5;&#x4E00;&#x6BB5;&#x8FC7;&#x65F6;&#x7684;&#x547D;&#x4EE4;&#x5217;&#x8868;&#x8BA9;&#x4EBA;&#x66F4;&#x6CAE;&#x4E27;...&lt;/p&gt;

&lt;p&gt;&lt;strong&gt;&#x8865;&#x5145;&#x8BF4;&#x660E;&lt;/strong&gt;&lt;/p&gt;

&lt;pre&gt;&lt;code&gt;&#x6559;&#x8BAD;:&#x4E2A;&#x4EBA;&#x6709;&#x4E24;&#x6B21;&#x8BEF;&#x5220;&#x6570;&#x636E;&#x90FD;&#x662F;&#x4ECE;&#x5386;&#x53F2;&#x547D;&#x4EE4;&#x4E2D;&#x67E5;&#x51FA;&#x95EE;&#x9898;&#x7684;

&#x4E24;&#x4E2A;&#x4E0E; history &#x76F8;&#x5173;&#x7684;&#x73AF;&#x5883;&#x53D8;&#x91CF;:$HISTSIZE $HISTTIMEFORMAT,&#x8BBE;&#x7F6E;&#x540E;&#x8005;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x9ED8;&#x8BA4;&#x5386;&#x53F2;&#x547D;&#x4EE4;&#x4E0D;&#x663E;&#x793A;&#x65F6;&#x95F4;&#x7684;&#x95EE;&#x9898;
&lt;/code&gt;&lt;/pre&gt;

&lt;hr&gt;

&lt;h4 id="toc_4"&gt;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x4EC0;&#x4E48;&lt;/h4&gt;

&lt;pre&gt;&lt;code&gt;$ pstree -a
$ ps aux
&lt;/code&gt;&lt;/pre&gt;

&lt;p&gt;&#x867D;&#x7136; ps aux &#x7684;&#x4FE1;&#x606F;&#x53EF;&#x80FD;&#x4F1A;&#x5F88;&#x5197;&#x957F;,pstree -aup &#x5374;&#x7ED9;&#x4F60;&#x5F88;&#x597D;&#x7684;&#x6D53;&#x7F29;&#x7684;&#x5173;&#x4E8E;&#x6B63;&#x5728;&#x8FD0;&#x884C; &#x7684;&#x8FDB;&#x7A0B;&#x548C;&#x8C03;&#x7528;&#x8FDB;&#x7A0B;&#x7684;&#x7528;&#x6237;&#x4FE1;&#x606F;,&#x53EF;&#x4EE5;&#x7EB5;&#x89C8;&#x6574;&#x4E2A;&#x8FDB;&#x7A0B;&#x6811;&#x7ED3;&#x6784;&#x3002;&lt;/p&gt;

&lt;p&gt;&lt;strong&gt;&#x8865;&#x5145;&#x8BF4;&#x660E;&lt;/strong&gt;&lt;/p&gt;

&lt;pre&gt;&lt;code&gt;PS &#x67E5;&#x770B;&#x8FDB;&#x7A0B;&#x5E38;&#x89C1;&#x547D;&#x4EE4;

&#x5185;&#x5B58;&#x4F7F;&#x7528;&#x6392;&#x5E8F; ps -e -o &amp;quot;%C : %p : %z : %a&amp;quot;|sort -k5 -nr
CPU &#x4F7F;&#x7528;&#x6392;&#x5E8F; ps-e -o&amp;quot;%C :%p:%z:%a&amp;quot;|sort -nr
&#x6E05;&#x9664;&#x50F5;&#x6B7B;&#x8FDB;&#x7A0B; ps -eal | awk &amp;#39;{ if ($2 == &amp;quot;Z&amp;quot;) {print $4}}&amp;#39; | kill -9
&lt;/code&gt;&lt;/pre&gt;

&lt;hr&gt;

&lt;h4 id="toc_5"&gt;&#x76D1;&#x542C;&#x7684;&#x670D;&#x52A1;&lt;/h4&gt;

&lt;pre&gt;&lt;code&gt;$ netstat -ntlp
$ netstat -nulp
$ netstat -nxlp
&lt;/code&gt;&lt;/pre&gt;

&lt;p&gt;&#x867D;&#x7136; netstat -nalp &#x80FD;&#x505A;&#x6240;&#x6709;&#x7684;&#x4E8B;&#x60C5;,&#x6211;&#x503E;&#x5411;&#x4E8E;&#x5355;&#x72EC;&#x6267;&#x884C;&#x5B83;&#x4EEC;,&#x4E3B;&#x8981;&#x662F;&#x56E0;&#x4E3A;&#x4E0D;&#x60F3;&#x540C;&#x65F6; &#x67E5;&#x770B;&#x6240;&#x6709;&#x7684;&#x670D;&#x52A1;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x8BC6;&#x522B;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x670D;&#x52A1;&#x5E76;&#x786E;&#x5B9A;&#x5B83;&#x4EEC;&#x662F;&#x5426;&#x662F;&#x671F;&#x671B;&#x8FD0;&#x884C;&#x7684;&#x3002;&#x67E5;&#x770B;&#x4E0D;&#x540C;&#x7684;&#x76D1;&#x542C;&#x7AEF;&#x53E3;,&#x4F60;&#x53EF;&#x4EE5;&#x59CB;&#x7EC8; &#x5C06; PID &#x4E0E; ps aux &#x7684;&#x8F93;&#x51FA;&#x8FDB;&#x884C;&#x5339;&#x914D;;&#x8FD9;&#x4F1A;&#x975E;&#x5E38;&#x6709;&#x7528;&#x7279;&#x522B;&#x662F;&#x5F53;&#x4F60;&#x6740;&#x6389;&#x540C;&#x65F6;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x591A;&#x4E2A; Java &#x6216; Erlang &#x8FDB;&#x7A0B;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x504F;&#x5411;&#x4E8E;&#x5728;&#x6BCF;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x8FD0;&#x884C;&#x7740;&#x8F83;&#x5C11;&#x6570;&#x91CF;&#x7684;&#x670D;&#x52A1;,&#x5FC5;&#x8981;&#x65F6;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x589E;&#x52A0;&#x673A;&#x5668;&#x3002;&#x5982;&#x679C; &#x4F60;&#x770B;&#x5230;&#x5F88;&#x591A;&#x76D1;&#x542C;&#x7AEF;&#x53E3;&#x4F60;&#x6216;&#x8BB8;&#x5E94;&#x8BE5;&#x53BB;&#x601D;&#x8003;&#x5E76;&#x505A;&#x8FDB;&#x4E00;&#x6B65;&#x8C03;&#x67E5;,&#x770B;&#x770B;&#x6709;&#x54EA;&#x4E9B;&#x53EF;&#x4EE5;&#x6E05;&#x7406;&#x6216;&#x8005;&#x91CD;&#x7EC4;&#x3002;&lt;/p&gt;

&lt;p&gt;&lt;strong&gt;&#x8865;&#x5145;&#x8BF4;&#x660E;&lt;/strong&gt;&lt;/p&gt;

&lt;pre&gt;&lt;code&gt;netstat &#x5E38;&#x89C1;&#x7EDF;&#x8BA1;

netstat -n | awk &amp;#39;/^tcp/ {++S[$NF]} END {for(a in S) print a,S[a]}&amp;#39;
netstat -an -t | grep &amp;quot;:80&amp;quot; | grep ESTABLISHED | awk &amp;#39;{printf&amp;quot;%s %s\n&amp;quot;,$5,$6}&amp;#39; | sort

ss &#x548C; ip &#x53D6;&#x4EE3; netstat&#x3010;&#x60F3;&#x8981;&#x77E5;&#x9053;&#x539F;&#x56E0;&#x7684;&#x8BF7;&#x67E5;&#x770B; http://roclinux.cn/?p=2420&#x3011;

&#x5728; man netstat &#x65F6;&#x4F1A;&#x770B;&#x5230;&#x8FD9;&#x53E5;&#x8BDD; This program is obsolete. &#x66FF;&#x4EE3; netstat &#x7684;&#x662F; ss &#x547D;&#x4EE4;&#x3002;&#x66FF;&#x4EE3; netstat -r &#x7684;&#x662F; ip route&#x3002;&#x66FF;&#x4EE3; netstat -i &#x7684;&#x662F; ip -s link&#x3002;&#x66FF;&#x4EE3; netstat -g &#x7684;&#x662F; ip maddr&#x3002;&#x5177;&#x4F53;&#x5BF9;&#x5E94;&#x5173;&#x7CFB;&#x5982;&#x4E0B; &#x56FE;&#x6240;&#x793A;&#x3002;
&lt;/code&gt;&lt;/pre&gt;

&lt;p&gt;&lt;img src="/assets/media/linux/tu2.png" alt="ss ip command"&gt;&lt;/p&gt;

&lt;hr&gt;

&lt;h4 id="toc_6"&gt;CPU&#x548C;RAM&lt;/h4&gt;

&lt;pre&gt;&lt;code&gt;$ free -m
$ uptime
$ top
$ htop
&lt;/code&gt;&lt;/pre&gt;

&lt;p&gt;&#x8FD9;&#x5E94;&#x8BE5;&#x80FD;&#x56DE;&#x7B54;&#x4E00;&#x4E9B;&#x95EE;&#x9898;:&lt;/p&gt;

&lt;ul&gt;
&lt;li&gt;&#x662F;&#x5426;&#x6709;&#x4EFB;&#x4F55;&#x53EF;&#x7528;&#x5185;&#x5B58;?&#x662F;&#x4EA4;&#x6362;&#x5185;&#x5B58;&#x5417;?&lt;/li&gt;
&lt;li&gt;&#x662F;&#x5426;&#x6709; CPU &#x5269;&#x4F59;&#x53EF;&#x7528;?&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x6709;&#x591A;&#x5C11; CPU &#x6838;&#x53EF;&#x7528;?&#x662F;&#x5426;&#x6709; CPU &#x6838;&#x8FC7;&#x8F7D;?&lt;/li&gt;
&lt;li&gt;&#x4EC0;&#x4E48;&#x5BFC;&#x81F4;&#x6700;&#x591A;&#x8D1F;&#x8F7D;?&#x5E73;&#x5747;&#x8D1F;&#x8F7D;&#x662F;&#x591A;&#x5C11;?&lt;/li&gt;
&lt;/ul&gt;

&lt;p&gt;&lt;strong&gt;&#x8865;&#x5145;&#x8BF4;&#x660E;&lt;/strong&gt;&lt;/p&gt;

&lt;pre&gt;&lt;code&gt;load average &#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x6BCF;&#x79D2;&#x949F; CPU &#x7B49;&#x5F85;&#x8FD0;&#x884C;&#x7684;&#x8FDB;&#x7A0B;&#x4E2A;&#x6570;. &#x5728; Linux &#x7CFB;&#x7EDF;&#x4E2D;, sar -q&#x3001;uptime&#x3001;w&#x3001;top &#x7B49;&#x547D;&#x4EE4;&#x90FD;&#x4F1A;&#x6709;&#x7CFB;&#x7EDF;&#x5E73;&#x5747;&#x8D1F;&#x8F7D; load average &#x7684;&#x8F93;&#x51FA;,&#x90A3; &#x4E48;&#x4EC0;&#x4E48;&#x662F;&#x7CFB;&#x7EDF;&#x5E73;&#x5747;&#x8D1F;&#x8F7D;&#x5462;? &#x7CFB;&#x7EDF;&#x5E73;&#x5747;&#x8D1F;&#x8F7D;&#x88AB;&#x5B9A;&#x4E49;&#x4E3A;&#x5728;&#x7279;&#x5B9A;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#x5185;&#x8FD0;&#x884C;&#x961F;&#x5217;&#x4E2D; &#x7684;&#x5E73;&#x5747;&#x4EFB;&#x52A1;&#x6570;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x6EE1;&#x8DB3;&#x4EE5;&#x4E0B;&#x6761;&#x4EF6;&#x5219;&#x5176;&#x5C31;&#x4F1A;&#x4F4D;&#x4E8E;&#x8FD0;&#x884C;&#x961F;&#x5217;&#x4E2D;:

+ &#x5B83;&#x6CA1;&#x6709;&#x5728;&#x7B49;&#x5F85; I/O &#x64CD;&#x4F5C;&#x7684;&#x7ED3;&#x679C;
+ &#x5B83;&#x6CA1;&#x6709;&#x4E3B;&#x52A8;&#x8FDB;&#x5165;&#x7B49;&#x5F85;&#x72B6;&#x6001;(&#x4E5F;&#x5C31;&#x662F;&#x6CA1;&#x6709;&#x8C03;&#x7528;&amp;#39;wait&amp;#39;) 
+ &#x6CA1;&#x6709;&#x88AB;&#x505C;&#x6B62;(&#x4F8B;&#x5982;:&#x7B49;&#x5F85;&#x7EC8;&#x6B62;)

htop &#x662F;&#x4E00;&#x4E2A;&#x4EA4;&#x4E92;&#x5F0F;&#x52A8;&#x6001;&#x8FDB;&#x7A0B;&#x67E5;&#x770B;&#x5668;&#x3002;&#x4E0E; Linux &#x4F20;&#x7EDF;&#x7684; top &#x76F8;&#x6BD4;,htop &#x66F4;&#x52A0;&#x4EBA;&#x6027;&#x5316;&#x3002; &#x5B83;&#x53EF;&#x8BA9;&#x7528;&#x6237;&#x4EA4;&#x4E92;&#x5F0F;&#x64CD;&#x4F5C;,&#x652F;&#x6301;&#x989C;&#x8272;&#x4E3B;&#x9898;,&#x53EF;&#x6A2A;&#x5411;&#x6216;&#x7EB5;&#x5411;&#x6EDA;&#x52A8;&#x6D4F;&#x89C8;&#x8FDB;&#x7A0B;&#x5217;&#x8868;,&#x5E76;&#x652F;&#x6301; &#x9F20;&#x6807;&#x64CD;&#x4F5C;,&#x6740;&#x8FDB;&#x7A0B;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x8FDB;&#x7A0B;&#x53F7;
&lt;/code&gt;&lt;/pre&gt;

&lt;p&gt;&lt;img src="/assets/media/linux/tu3.png" alt="htop command"&gt;&lt;/p&gt;

&lt;hr&gt;

&lt;h4 id="toc_7"&gt;&#x786C;&#x4EF6;&lt;/h4&gt;

&lt;pre&gt;&lt;code&gt;$ lspci
$ dmidecode
$ ethtool
&lt;/code&gt;&lt;/pre&gt;

&lt;p&gt;&#x4F9D;&#x7136;&#x6709;&#x5F88;&#x591A;&#x88F8;&#x673A;&#x670D;&#x52A1;&#x5668;,&#x8FD9;&#x53EF;&#x4EE5;&#x5E2E;&#x4F60;&#x56DE;&#x7B54;&#x4EE5;&#x4E0B;&#x95EE;&#x9898;:&lt;/p&gt;

&lt;ul&gt;
&lt;li&gt;&#x8BC6;&#x522B; RAID &#x5361;(&#x4EE5;&#x53CA;&#x662F;&#x5426;&#x6709; BBU &#x5907;&#x7528;&#x7535;&#x6C60;?),CPU,&#x4EE5;&#x53CA;&#x53EF;&#x7528;&#x7684;&#x5185;&#x5B58;&#x69FD;&#x4F4D;&#x3002;&#x8FD9;&#x53EF;&#x80FD;&#x7ED9; &#x4F60;&#x4E00;&#x4E9B;&#x5728;&#x6F5C;&#x5728;&#x7684;&#x95EE;&#x9898;&#x8FFD;&#x8E2A;&#x6216;&#x6027;&#x80FD;&#x63D0;&#x5347;&#x65B9;&#x9762;&#x7684;&#x63D0;&#x793A;&#x3002;&lt;/li&gt;
&lt;li&gt;&#x7F51;&#x5361;&#x662F;&#x5426;&#x6B63;&#x786E;&#x8BBE;&#x7F6E;?&#x662F;&#x5426;&#x8FD0;&#x884C;&#x5728;&#x534A;&#x53CC;&#x5DE5;&#x6A21;&#x5F0F;?&#x7F51;&#x901F;&#x662F; 10MBps?&#x4EFB;&#x4F55;&#x53D1;&#x9001;/&#x63A5;&#x6536;&#x9519; &#x8BEF;?&lt;/li&gt;
&lt;/ul&gt;

&lt;p&gt;&lt;strong&gt;&#x8865;&#x5145;&#x8BF4;&#x660E;&lt;/strong&gt;&lt;/p&gt;

&lt;pre&gt;&lt;code&gt;dmidecode &#x8FD9;&#x6B3E;&#x8F6F;&#x4EF6;&#x5141;&#x8BB8;&#x4F60;&#x5728; Linux &#x7CFB;&#x7EDF;&#x4E0B;&#x83B7;&#x53D6;&#x6709;&#x5173;&#x786C;&#x4EF6;&#x65B9;&#x9762;&#x7684;&#x4FE1;&#x606F;&#x3002; dmidecode &#x9075;&#x5FAA; SMBIOS/DMI &#x6807;&#x51C6;,&#x5176;&#x8F93;&#x51FA;&#x7684;&#x4FE1;&#x606F;&#x5305;&#x62EC; BIOS&#x3001;&#x7CFB;&#x7EDF;&#x3001;&#x4E3B;&#x677F;&#x3001;&#x5904; &#x7406;&#x5668;&#x3001;&#x5185;&#x5B58;&#x3001;&#x7F13;&#x5B58;&#x7B49;&#x7B49;&#x3002;CMDB/&#x76D1;&#x63A7;&#x7CFB;&#x7EDF;&#x83B7;&#x53D6;&#x673A;&#x5668;&#x786C;&#x4EF6;&#x7B49;&#x57FA;&#x7840;&#x4FE1;&#x606F;&#x6BD4;&#x5982; SN &#x53F7;&#x4F7F;&#x7528;&#x3002;

ethtool &#x7528;&#x4E8E;&#x67E5;&#x8BE2;&#x53CA;&#x8BBE;&#x7F6E;&#x7F51;&#x5361;&#x53C2;&#x6570;&#x7684;&#x547D;&#x4EE4;
+ ethtool ethX //&#x67E5;&#x8BE2; ethX &#x7F51;&#x53E3;&#x57FA;&#x672C;&#x8BBE;&#x7F6E;
+ ethtool &#x2013;h //&#x663E;&#x793A; ethtool &#x7684;&#x547D;&#x4EE4;&#x5E2E;&#x52A9;(help)
+ ethtool &#x2013;i ethX //&#x67E5;&#x8BE2; ethX &#x7F51;&#x53E3;&#x7684;&#x76F8;&#x5173;&#x4FE1;&#x606F;
+ ethtool &#x2013;d ethX //&#x67E5;&#x8BE2; ethX &#x7F51;&#x53E3;&#x6CE8;&#x518C;&#x6027;&#x4FE1;&#x606F;
+ ethtool &#x2013;r ethX //&#x91CD;&#x7F6E; ethX &#x7F51;&#x53E3;&#x5230;&#x81EA;&#x9002;&#x5E94;&#x6A21;&#x5F0F;
+ ethtool &#x2013;S ethX //&#x67E5;&#x8BE2; ethX &#x7F51;&#x53E3;&#x6536;&#x53D1;&#x5305;&#x7EDF;&#x8BA1;
+ ethtool &#x2013;sethX[speed10|100|1000]//&#x8BBE;&#x7F6E;&#x7F51;&#x53E3;&#x901F;&#x7387;10/100/1000M
&lt;/code&gt;&lt;/pre&gt;

&lt;hr&gt;

&lt;h4 id="toc_8"&gt;IO &#x6027;&#x80FD;&lt;/h4&gt;

&lt;pre&gt;&lt;code&gt;$ iostat -kx 2
$ vmstat 2 10
$ mpstat 2 10
$ dstat --top-io --top-bio
&lt;/code&gt;&lt;/pre&gt;

&lt;p&gt;&#x8FD9;&#x4E9B;&#x547D;&#x4EE4;&#x5BF9;&#x4E8E;&#x5206;&#x6790;&#x540E;&#x7AEF;&#x6027;&#x80FD;&#x975E;&#x5E38;&#x6709;&#x7528;&#x3002;&lt;/p&gt;

&lt;ul&gt;
&lt;li&gt;&#x67E5;&#x770B;&#x78C1;&#x76D8;&#x4F7F;&#x7528;:&#x76D2;&#x5B50;&#x662F;&#x5426;&#x6709;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;/&#x78C1;&#x76D8;&#x7684;&#x78C1;&#x76D8;&#x4F7F;&#x7528;&#x7387;&#x8FBE;&#x5230; 100%&lt;/li&gt;
&lt;li&gt;&#x4EA4;&#x6362;&#x5206;&#x533A;&#x76EE;&#x524D;&#x662F;&#x5426;&#x5728;&#x4F7F;&#x7528;(si/so)?&lt;/li&gt;
&lt;li&gt;&#x4EC0;&#x4E48;&#x6700;&#x5360;&#x7528; CPU:system?user?stolen(vm)?&lt;/li&gt;
&lt;li&gt;dstat &#x662F;&#x6211;&#x7684;&#x6700;&#x7231;&#x3002;&#x4EC0;&#x4E48;&#x8FDB;&#x7A0B;&#x5728;&#x4F7F;&#x7528; IO?&#x662F; MySQL &#x5728;&#x5438;&#x6536;&#x8D44;&#x6E90;&#x5462;&#x8FD8;&#x662F; PHP &#x8FDB;&#x7A0B;?&lt;/li&gt;
&lt;/ul&gt;

&lt;p&gt;&lt;strong&gt;&#x8865;&#x5145;&#x8BF4;&#x660E;&lt;/strong&gt;&lt;/p&gt;

&lt;pre&gt;&lt;code&gt;dstat &#x4F7F;&#x7528;&#x7B80;&#x4FBF;&#x8BB0;&#x6CD5;:dstat &#x547D;&#x4EE4;&#x5F88;&#x5F3A;&#x5927;,&#x4F46;&#x662F;&#x547D;&#x4EE4;&#x9009;&#x9879;&#x6BD4;&#x8F83;&#x591A;&#x5F88;&#x96BE;&#x8BB0;&#x3002;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x505A;&#x8FD0;&#x7EF4;&#x7684;&#x5374;&#x5F88;&#x597D;&#x8BB0;&#x5FC6;&#x53EA;&#x9700;&#x8981;&#x8BB0;&#x4F4F;&#x3010;-lamps&#x3011;&#x5373;&#x53EF;&#x3002;
&lt;/code&gt;&lt;/pre&gt;

&lt;p&gt;&lt;img src="/assets/media/linux/tu4.png" alt="dstat command"&gt;&lt;/p&gt;

&lt;pre&gt;&lt;code&gt;vmstat/iostat/mpstat
+ vmstat&#x76D1;&#x89C6;&#x5185;&#x5B58;&#x4F7F;&#x7528;&#x60C5;&#x51B5;:vmstat&#x662F;VirtualMeomoryStatistics(&#x865A;&#x62DF;&#x5185;&#x5B58;&#x7EDF;&#x8BA1;)&#x7684;&#x7F29;&#x5199;,&#x53EF;&#x5BF9;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x3001;&#x8FDB;&#x7A0B;&#x3001;CPU &#x6D3B;&#x52A8;&#x8FDB;&#x884C;&#x76D1;&#x89C6;&#x3002;&#x5B83;&#x662F;&#x5BF9;&#x7CFB;&#x7EDF;&#x7684;&#x6574;&#x4F53;&#x60C5;&#x51B5;&#x8FDB;&#x884C;&#x7EDF;&#x8BA1;,&#x4E0D;&#x8DB3;&#x4E4B;&#x5904;&#x662F;&#x65E0;&#x6CD5;&#x5BF9;&#x67D0;&#x4E2A;&#x8FDB;&#x7A0B;&#x8FDB;&#x884C;&#x6DF1;&#x5165;&#x5206;&#x6790;&#x3002;

+ iostat &#x76D1;&#x89C6; I/O &#x5B50;&#x7CFB;&#x7EDF;&#x60C5;&#x51B5;:iostat &#x662F; I/O statistics(&#x8F93;&#x5165;/&#x8F93;&#x51FA;&#x7EDF; &#x8BA1;)&#x7684;&#x7F29;&#x5199;,iostat &#x5DE5;&#x5177;&#x5C06;&#x5BF9;&#x7CFB;&#x7EDF;&#x7684;&#x78C1;&#x76D8;&#x64CD;&#x4F5C;&#x6D3B;&#x52A8;&#x8FDB;&#x884C;&#x76D1;&#x89C6;&#x3002;&#x5B83;&#x7684;&#x7279;&#x70B9;&#x662F;&#x6C47;&#x62A5;&#x78C1;&#x76D8;&#x6D3B;&#x52A8;&#x7EDF;&#x8BA1;&#x60C5;&#x51B5;,&#x540C;&#x65F6;&#x4E5F;&#x4F1A;&#x6C47;&#x62A5;&#x51FA; CPU &#x4F7F;&#x7528;&#x60C5;&#x51B5;&#x3002;&#x540C; vmstat &#x4E00;&#x6837;,iostat &#x4E5F;&#x6709;&#x4E00;&#x4E2A;&#x5F31;&#x70B9;,&#x5C31;&#x662F;&#x5B83;&#x4E0D;&#x80FD;&#x5BF9;&#x67D0;&#x4E2A;&#x8FDB;&#x7A0B;&#x8FDB;&#x884C;&#x6DF1;&#x5165;&#x5206;&#x6790;,&#x4EC5;&#x5BF9;&#x7CFB;&#x7EDF;&#x7684;&#x6574;&#x4F53;&#x60C5;&#x51B5;&#x8FDB;&#x884C;&#x5206;&#x6790;&#x3002;

+ mpstat &#x662F; Multiprocessor Statistics &#x7684;&#x7F29;&#x5199;,&#x662F;&#x5B9E;&#x65F6;&#x7CFB;&#x7EDF;&#x76D1;&#x63A7;&#x5DE5;&#x5177;&#x3002;&#x5176;&#x62A5;&#x544A;&#x4E0E; CPU &#x7684;&#x4E00;&#x4E9B;&#x7EDF;&#x8BA1;&#x4FE1;&#x606F;,&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x5B58;&#x653E;&#x5728;/proc/stat &#x6587;&#x4EF6;&#x4E2D;&#x3002;&#x5728;&#x591A; CPUs &#x7CFB;&#x7EDF;&#x91CC;,&#x5176;&#x4E0D;&#x4F46;&#x80FD;&#x67E5;&#x770B;&#x6240;&#x6709; CPU &#x7684;&#x5E73;&#x5747;&#x72B6;&#x51B5;&#x4FE1;&#x606F;,&#x800C;&#x4E14;&#x80FD;&#x591F;&#x67E5;&#x770B;&#x7279;&#x5B9A; CPU &#x7684;&#x4FE1;&#x606F;&#x3002;&#x4F7F;&#x7528; mpstat -P ALL &#x53EF;&#x67E5;&#x770B;&#x6240;&#x6709;&#x6838;&#x3002;
&lt;/code&gt;&lt;/pre&gt;

&lt;hr&gt;

&lt;h4 id="toc_9"&gt;&#x6302;&#x8F7D;&#x70B9;&#x548C;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&lt;/h4&gt;

&lt;pre&gt;&lt;code&gt;$ mount
$ cat /etc/fstab
$ vgs
$ pvs
$ lvs
$ df -h
$ lsof +D / /* beware not to kill your box */
&lt;/code&gt;&lt;/pre&gt;

&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&#x6709;&#x591A;&#x5C11;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x88AB;&#x6302;&#x8F7D;?&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x662F;&#x5426;&#x5B58;&#x5728;&#x67D0;&#x4E9B;&#x670D;&#x52A1;&#x6709;&#x4E13;&#x7528;&#x6302;&#x8F7D;&#x70B9;(&#x53EF;&#x80FD;&#x662F; MySQL...)?&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x6302;&#x8F7D;&#x9009;&#x9879;:noatime?default?&#x662F;&#x5426;&#x6709;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x88AB;&#x91CD;&#x65B0;&#x6302;&#x8F7D;&#x4E3A;&#x53EA;&#x8BFB;?&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x78C1;&#x76D8;&#x662F;&#x5426;&#x6709;&#x5269;&#x4F59;&#x7A7A;&#x95F4;?&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x662F;&#x5426;&#x6709;&#x4EFB;&#x4F55;&#x5927;&#x6587;&#x4EF6;(&#x5220;&#x9664;&#x6587;&#x4EF6;)&#x6CA1;&#x6709;&#x88AB;&#x5237;&#x65B0;?&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x5982;&#x679C;&#x78C1;&#x76D8;&#x7A7A;&#x95F4;&#x6210;&#x4E3A;&#x95EE;&#x9898;&#x662F;&#x5426;&#x6709;&#x5269;&#x4F59;&#x7A7A;&#x95F4;&#x7528;&#x4EE5;&#x6269;&#x5C55;&#x5206;&#x533A;?&lt;/p&gt;&lt;/li&gt;
&lt;/ul&gt;

&lt;p&gt;&lt;strong&gt;&#x8865;&#x5145;&#x8BF4;&#x660E;&lt;/strong&gt;&lt;/p&gt;

&lt;pre&gt;&lt;code&gt;&#x5E38;&#x89C1;&#x8BBE;&#x5907; mount &#x64CD;&#x4F5C;

+ USB &#x8BBE;&#x5907;:mkdir /mnt/usb;mount -t vfat /dev/sda /mnt/usb
+ &#x5149;&#x76D8;&#x8BBE;&#x5907;:mkdir /mnt/cdrom;mount -t iso9660 /dev/cdrom /mnt/cdrom
+ ISO &#x6587;&#x4EF6;:mount -o loop pes6.iso /mnt/cdrom

LVM &#x903B;&#x8F91;&#x5377;&#x7684;&#x521B;&#x5EFA;,&#x4F7F;&#x7528;,&#x5220;&#x9664;
+ &#x521B;&#x5EFA;&#x903B;&#x8F91;&#x5377;
    + pvcreate &#x5C06;&#x7269;&#x7406;&#x786C;&#x76D8;&#x683C;&#x5F0F;&#x5316;&#x6210; PV(&#x7269;&#x7406;&#x5377;)
    + vgcreate &#x521B;&#x5EFA; VG(&#x5377;&#x7EC4;),&#x5E76;&#x5C06; PV &#x52A0;&#x5165;&#x5230;&#x5377;&#x7EC4;
    + lvcreate &#x57FA;&#x4E8E; VG(&#x5377;&#x7EC4;)&#x521B;&#x5EFA; LV(&#x903B;&#x8F91;&#x5377;)
+ &#x4F7F;&#x7528;&#x903B;&#x8F91;&#x5377;: &#x683C;&#x5F0F;&#x5316;&#x3010;&#x5982; mkfs.ext4&#x3011;&#x540E;&#x518D; mount
+ &#x5220;&#x9664;&#x903B;&#x8F91;&#x5377;: umount -&amp;gt; lvremove -&amp;gt; vgremove -&amp;gt; pvremove
&lt;/code&gt;&lt;/pre&gt;

&lt;hr&gt;

&lt;h4 id="toc_10"&gt;&#x5185;&#x6838;,&#x4E2D;&#x65AD;&#x548C;&#x7F51;&#x7EDC;&lt;/h4&gt;

&lt;pre&gt;&lt;code&gt;$ sysctl -a | grep ...
$ cat /proc/interrupts
$ cat /proc/net/ip_conntrack /* may take some time on busy servers */ 
$ netstat
$ ss -s
&lt;/code&gt;&lt;/pre&gt;

&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&#x4E2D;&#x65AD;&#x8BF7;&#x6C42;&#x662F;&#x5426;&#x5728; CPU &#x4E4B;&#x95F4;&#x5747;&#x8861;&#x8D1F;&#x8F7D;?&#x6216;&#x8005;&#x662F;&#x5426;&#x67D0;&#x4E2A;&#x6838;&#x56E0;&#x4E3A;&#x7F51;&#x7EDC;&#x4E2D;&#x65AD;,RAID &#x5361;&#x7B49;&#x9020;&#x6210; &#x8FC7;&#x8F7D;?&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;SWAP &#x8BBE;&#x7F6E;&#x591A;&#x5C11;?&#x5BF9;&#x4E8E;&#x5DE5;&#x4F5C;&#x7AD9; 60 &#x5C31;&#x591F;&#x4E86;,&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x670D;&#x52A1;&#x5668;&#x8FD9;&#x901A;&#x5E38;&#x662F;&#x4E00;&#x4E2A;&#x574F;&#x4E3B;&#x610F;:&#x4F60; &#x4E0D;&#x5E0C;&#x671B;&#x4F60;&#x7684;&#x670D;&#x52A1;&#x5668;&#x603B;&#x662F;&#x5728;&#x4EA4;&#x6362;&#x3002;&#x5426;&#x5219;&#x5F53;&#x6570;&#x636E;&#x5728;&#x8BFB;&#x5199;&#x5728;&#x8FDB;&#x884C;&#x78C1;&#x76D8;&#x8BFB;&#x5199;&#x65F6;&#x4F60;&#x7684;&#x4EA4;&#x6362;&#x8FDB;&#x7A0B; &#x5C06;&#x4F1A;&#x88AB;&#x9501;&#x4F4F;&#x3002;&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;conntrack_max &#x662F;&#x5426;&#x8BBE;&#x7F6E;&#x5F97;&#x8DB3;&#x591F;&#x9AD8;&#x4EE5;&#x5904;&#x7406;&#x7F51;&#x7EDC;&#x6D41;&#x91CF;?&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;TCP &#x8FDE;&#x63A5;&#x4E0D;&#x540C;&#x72B6;&#x6001;&#x82B1;&#x8D39;&#x591A;&#x957F;&#x65F6;&#x95F4;(TIME_WAIT,...)?&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;netstat &#x5728;&#x663E;&#x793A;&#x6240;&#x6709;&#x5B58;&#x5728;&#x5F97;&#x8FDE;&#x63A5;&#x65F6;&#x53EF;&#x80FD;&#x5F88;&#x6162;,&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x4F7F;&#x7528; ss &#x6765;&#x83B7;&#x53D6;&#x4E00;&#x4E2A;&#x6982;&#x51B5;&#x3002;&lt;/p&gt;&lt;/li&gt;
&lt;/ul&gt;

&lt;p&gt;&#x67E5;&#x770B;&lt;a href="http://www.lognormal.com/blog/2012/09/27/linux-tcpip-tuning/"&gt;Linux TCP Tuning&lt;/a&gt;&#x4EE5;&#x83B7;&#x53D6;&#x66F4;&#x591A; &#x4FE1;&#x606F;&#x4F5C;&#x4E3A;&#x5982;&#x4F55;&#x4F18;&#x5316;&#x7F51;&#x7EDC;&#x6808;&#x6307;&#x5357;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x5173;&#x4E8E;&#x4E2D;&#x65AD;&#x4EB2;&#x548C;&#x529B;&#x4EE5;&#x53CA;&#x7EBF;&#x7A0B;&#x5316;&#x6211;&#x4E4B;&#x524D;&#x6709;&#x7BC7;&lt;a href="http://junqili.com/linux/%E6%B7%B1%E5%85%A5%E7%90%86%E8%A7%A3%20linux%20%E5%86%85%E6%A0%B8%E4%B8%AD%E6%96%AD%E5%8F%8A%E5%85%B6%E7%89%B9%E6%80%A7-%E6%9B%B4%E6%96%B0/"&gt;&#x535A;&#x5BA2;&lt;/a&gt;&#x8C08;&#x5230;&#x8FC7;&#x3002;&lt;/p&gt;

&lt;hr&gt;

&lt;h4 id="toc_11"&gt;&#x7CFB;&#x7EDF;&#x65E5;&#x5FD7;&#x548C;&#x5185;&#x6838;&#x6D88;&#x606F;&lt;/h4&gt;

&lt;pre&gt;&lt;code&gt;$ dmesg
$ less /var/log/messages
$ less /var/log/secure
$ less /var/log/auth
&lt;/code&gt;&lt;/pre&gt;

&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&#x67E5;&#x770B;&#x4EFB;&#x4F55;&#x9519;&#x8BEF;&#x6216;&#x8B66;&#x544A;&#x6D88;&#x606F;;&#x5B83;&#x662F;&#x5426;&#x5206;&#x89E3;&#x4E86;&#x5173;&#x4E8E;&#x4F60;&#x7684; conntrack &#x8FDE;&#x63A5;&#x6570;&#x8BBE;&#x7F6E;&#x8FC7;&#x9AD8;&#x7684;&#x95EE; &#x9898;?&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x662F;&#x5426;&#x770B;&#x89C1;&#x786C;&#x4EF6;&#x9519;&#x8BEF;&#x6216;&#x8005;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x9519;&#x8BEF;?&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x80FD;&#x5426;&#x5173;&#x8054;&#x8FD9;&#x4E9B;&#x4E8B;&#x4EF6;&#x7684;&#x4E8B;&#x4EF6;&#x548C;&#x4E4B;&#x524D;&#x83B7;&#x53D6;&#x5230;&#x7684;&#x4FE1;&#x606F;?&lt;/p&gt;&lt;/li&gt;
&lt;/ul&gt;

&lt;p&gt;&lt;strong&gt;&#x8865;&#x5145;&#x8BF4;&#x660E;&lt;/strong&gt;&lt;/p&gt;

&lt;pre&gt;&lt;code&gt;/var/log/messages &#x5305;&#x62EC;&#x6574;&#x4F53;&#x7CFB;&#x7EDF;&#x4FE1;&#x606F;,&#x5176;&#x4E2D;&#x4E5F;&#x5305;&#x542B;&#x7CFB;&#x7EDF;&#x542F;&#x52A8;&#x671F;&#x95F4;&#x7684;&#x65E5;&#x5FD7;&#x3002;&#x6B64;&#x5916;, mail,cron,daemon,kern &#x548C; auth &#x7B49;&#x5185;&#x5BB9;&#x4E5F;&#x8BB0;&#x5F55;&#x5728; var/log/messages &#x65E5;&#x5FD7;&#x4E2D;&#x3002; &#x51E0;&#x4E4E;&#x7CFB;&#x7EDF;&#x53D1;&#x751F;&#x7684;&#x6240;&#x6709;&#x9519;&#x8BEF;&#x4FE1;&#x606F;(&#x6216;&#x8005;&#x91CD;&#x8981;&#x4FE1;&#x606F;)&#x90FD;&#x4F1A;&#x8BB0;&#x5F55;&#x5728;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x91CC;,&#x8FD9;&#x51E0;&#x4E4E;&#x662F; &#x7CFB;&#x7EDF;&#x53D1;&#x751F;&#x83AB;&#x540D;&#x9519;&#x8BEF;&#x5FC5;&#x67E5;&#x7684;&#x6587;&#x4EF6;&#x3002;
/var/log/dmesg &#x2014; &#x5305;&#x542B;&#x5185;&#x6838;&#x7F13;&#x51B2;&#x4FE1;&#x606F;(kernel ring buffer)&#x3002;&#x5728;&#x7CFB;&#x7EDF;&#x542F; &#x52A8;&#x65F6;,&#x4F1A;&#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#x663E;&#x793A;&#x8BB8;&#x591A;&#x4E0E;&#x786C;&#x4EF6;&#x6709;&#x5173;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x53EF;&#x4EE5;&#x7528; dmesg &#x67E5;&#x770B;&#x5B83;&#x4EEC;&#x3002;
/var/log/secure &#x5305;&#x542B;&#x9A8C;&#x8BC1;&#x548C;&#x6388;&#x6743;&#x65B9;&#x9762;&#x4FE1;&#x606F;&#x3002;&#x4F8B;&#x5982;,sshd &#x4F1A;&#x5C06;&#x6240;&#x6709;&#x4FE1;&#x606F;&#x8BB0;&#x5F55;(&#x5176; &#x4E2D;&#x5305;&#x62EC;&#x5931;&#x8D25;&#x767B;&#x5F55;)&#x5728;&#x8FD9;&#x91CC;&#x3002;&#x57FA;&#x672C;&#x4E0A;,&#x53EA;&#x8981;&#x6D89;&#x53CA;&#x5230;&#x9700;&#x8981;&#x8F93;&#x5165;&#x8D26;&#x53F7;&#x5BC6;&#x7801;&#x7684;&#x8F6F;&#x4EF6;,&#x90A3;&#x4E48;&#x5F53; &#x767B;&#x5F55;&#x65F6;(&#x65E0;&#x8BBA;&#x6B63;&#x786E;&#x9519;&#x8BEF;)&#x90FD;&#x4F1A;&#x8BB0;&#x5F55;&#x5230;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x3002;&#x5305;&#x62EC;&#x7CFB;&#x7EDF;&#x7684; login &#x7A0B;&#x5E8F;,&#x56FE;&#x5F62;&#x754C;&#x9762; &#x767B;&#x5F55;&#x6240;&#x4F7F;&#x7528;&#x7684; gdm &#x7A0B;&#x5E8F;,su, sudo &#x7B49;&#x7A0B;&#x5E8F;&#x8FD8;&#x6709;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x7684; ssh,telnet &#x7B49;&#x7A0B;&#x5E8F;&#x3002;
/var/log/auth &#x5305;&#x542B;&#x7CFB;&#x7EDF;&#x6388;&#x6743;&#x4FE1;&#x606F;,&#x5305;&#x62EC;&#x7528;&#x6237;&#x767B;&#x5F55;&#x548C;&#x4F7F;&#x7528;&#x7684;&#x6743;&#x9650;&#x673A;&#x5236;&#x7B49;&#x3002;
&lt;/code&gt;&lt;/pre&gt;

&lt;hr&gt;

&lt;h4 id="toc_12"&gt;&#x5B9A;&#x65F6;&#x4EFB;&#x52A1;&lt;/h4&gt;

&lt;pre&gt;&lt;code&gt;$ ls /etc/cron* + cat
$ for user in $(cat /etc/passwd | cut -f1 -d:); do crontab -l &#x2013;u $user; done
&lt;/code&gt;&lt;/pre&gt;

&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&#x662F;&#x5426;&#x6709;&#x5B9A;&#x65F6;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x592A;&#x8FC7;&#x9891;&#x7E41;?&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x662F;&#x5426;&#x5B58;&#x5728;&#x67D0;&#x4E9B;&#x7528;&#x6237;&#x7684;&#x5B9A;&#x65F6;&#x4EFB;&#x52A1;&#x88AB;&#x9690;&#x85CF;?&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x5728;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x65F6;&#x662F;&#x5426;&#x6709;&#x4E00;&#x4E9B;&#x5907;&#x4EFD;&#x5728;&#x8FD0;&#x884C;?&lt;/p&gt;&lt;/li&gt;
&lt;/ul&gt;

&lt;p&gt;&lt;strong&gt;&#x8865;&#x5145;&#x8BF4;&#x660E;&lt;/strong&gt;&lt;/p&gt;

&lt;pre&gt;&lt;code&gt;/var/log/cron &#x2014; &#x6BCF;&#x5F53; cron &#x8FDB;&#x7A0B;&#x5F00;&#x59CB;&#x4E00;&#x4E2A;&#x5DE5;&#x4F5C;&#x65F6;,&#x5C31;&#x4F1A;&#x5C06;&#x76F8;&#x5173;&#x4FE1;&#x606F;&#x8BB0;&#x5F55;&#x5728;&#x8FD9;&#x4E2A;&#x6587; &#x4EF6;&#x4E2D;&#x3002;
&#x5728;/etc/cron.d/ &#x76EE;&#x5F55;&#x4E0B;&#x5EFA;&#x7ACB;&#x7684; cron &#x6587;&#x4EF6;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x91CC;&#x6709;&#x591A;&#x6761; cron,&#x4E14;&#x6700;&#x540E; &#x901A;&#x8FC7; 2&amp;gt;&amp;amp;1 &#x91CD;&#x5B9A;&#x5411;&#x8F93;&#x51FA;,&#x6362;&#x884C;&#x5FC5;&#x987B;&#x662F; unix &#x683C;&#x5F0F;&#x7684;,&#x5982;&#x679C;&#x662F; dos &#x683C;&#x5F0F;&#x6362;&#x884C;,bash &#x4F1A; &#x62A5;&#x9519;,cron &#x662F;&#x65E0;&#x6CD5;&#x6B63;&#x5E38;&#x6267;&#x884C;&#x7684;&#x3002;
[Cron &#x4E32;&#x884C;&#x5316;](http://lilinux.tk/blog/2013/05/cron-sequential/)
&lt;/code&gt;&lt;/pre&gt;

&lt;hr&gt;

&lt;h4 id="toc_13"&gt;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65E5;&#x5FD7;&lt;/h4&gt;

&lt;p&gt;&#x8FD9;&#x91CC;&#x6709;&#x5F88;&#x591A;&#x53EF;&#x4EE5;&#x5206;&#x6790;&#x7684;&#x5730;&#x65B9;,&#x4F46;&#x662F;&#x5B83;&#x53EF;&#x80FD;&#x5374;&#x662F;&#x4F60;&#x5F00;&#x59CB;&#x4E0D;&#x80AF;&#x82B1;&#x65F6;&#x95F4;&#x7684;&#x5730;&#x65B9;,&#x4F60;&#x5173;&#x6CE8;&#x7684;&#x662F;&#x524D;&#x9762;&#x63D0; &#x5230;&#x7684;&#x90A3;&#x4E9B;&#x3002;&#x5C31; LAMP &#x4E3A;&#x4F8B;:&lt;/p&gt;

&lt;ul&gt;
&lt;li&gt;&lt;p&gt;Apache &amp;amp; Nginx;&#x8FFD;&#x6EAF; access log &#x548C; error log,&#x67E5;&#x627E; 5XX &#x9519;&#x8BEF;&#x548C;&#x53EF;&#x80FD;&#x7684; limit_zone &#x9519;&#x8BEF;&#x3002;&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;MySQL; &#x67E5;&#x770B; mysql.log &#x4E2D;&#x7684;&#x9519;&#x8BEF;,&#x8FFD;&#x8E2A;&#x635F;&#x574F;&#x7684;&#x6570;&#x636E;&#x5E93;&#x8868;,&#x540C;&#x65F6; innodb &#x542F;&#x52A8;&#x6062;&#x590D; &#x8FDB;&#x7A0B;&#x3002;&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;PHP-FPM;&#x5982;&#x679C;&#x542F;&#x7528; php-slow log,&#x6DF1;&#x6316;&#x65E5;&#x5FD7;&#x5E76;&#x5C3D;&#x91CF;&#x627E;&#x5230;&#x9519;&#x8BEF; (php,mysql,memcache...)&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;,&#x90A3;&#x5C31;&#x542F;&#x7528;&#x3002;&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;Varnish; &#x5728; varnishlog &#x548C; varnishstat &#x4E2D;,&#x68C0;&#x67E5; hit/miss &#x6BD4;&#x7387;&#x3002;&#x662F;&#x5426;&#x6709;&#x914D;&#x7F6E; &#x4E2D;&#x7684;&#x89C4;&#x5219;&#x672A;&#x547D;&#x4E2D;&#x800C;&#x5BFC;&#x81F4;&#x6700;&#x7EC8;&#x7528;&#x6237;&#x56DE;&#x6E90;&#x3002;&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;HA-Proxy;&#x540E;&#x7AEF;&#x7684;&#x72B6;&#x6001;&#x662F;&#x4EC0;&#x4E48;?&#x5065;&#x5EB7;&#x68C0;&#x67E5;&#x662F;&#x5426;&#x6210;&#x529F;?&#x662F;&#x5426;&#x8FBE;&#x5230;&#x524D;&#x7AEF;&#x6216;&#x8005;&#x540E;&#x7AEF;&#x6700;&#x5927;&#x961F; &#x5217;&#x5927;&#x5C0F;?&lt;/p&gt;&lt;/li&gt;
&lt;/ul&gt;

&lt;hr&gt;

&lt;h4 id="toc_14"&gt;&#x603B;&#x7ED3;&lt;/h4&gt;

&lt;p&gt;&#x7ECF;&#x8FC7;&#x8FD9;&#x5F00;&#x59CB;&#x7684; 5 &#x5206;&#x949F;&#x4F60;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x66F4;&#x597D;&#x7684;&#x4E86;&#x89E3;&#x5230;:&lt;/p&gt;

&lt;ul&gt;
&lt;li&gt;&lt;p&gt;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x4EC0;&#x4E48;&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x95EE;&#x9898;&#x662F;&#x5426;&#x4E0E; IO/&#x786C;&#x4EF6;/&#x7F51;&#x7EDC;&#x6216;&#x914D;&#x7F6E;(&#x4E0D;&#x597D;&#x7684;&#x4EE3;&#x7801;,&#x5185;&#x6838;&#x4F18;&#x5316;...)&#x76F8;&#x5173;&lt;/p&gt;&lt;/li&gt;
&lt;li&gt;&lt;p&gt;&#x662F;&#x5426;&#x6CE8;&#x610F;&#x5230;&#x67D0;&#x4E2A;&#x73B0;&#x8C61;:&#x4F8B;&#x5982;&#x6EE5;&#x7528;&#x6570;&#x636E;&#x5E93;&#x7D22;&#x5F15;,&#x6216;&#x8005;&#x592A;&#x591A; apache &#x5DE5;&#x4F5C;&#x8FDB;&#x7A0B;&lt;/p&gt;&lt;/li&gt;
&lt;/ul&gt;

&lt;p&gt;&#x4F60;&#x751A;&#x81F3;&#x53EF;&#x80FD;&#x53D1;&#x73B0;&#x95EE;&#x9898;&#x786E;&#x5207;&#x7684;&#x6700;&#x6839;&#x672C;&#x7684;&#x539F;&#x56E0;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;,&#x5728;&#x4F60;&#x4E86;&#x89E3;&#x4E86;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x4E4B;&#x540E;, &#x4E5F;&#x5E94;&#x8BE5;&#x5177;&#x6709;&#x4F5C;&#x4E3A;&#x7EE7;&#x7EED;&#x6DF1;&#x6316;&#x7684;&#x6761;&#x4EF6;&#x3002;&lt;/p&gt;
</description>
    </item>
  </channel>
</rss>
